{
  "main": {
    "added": [
      "Added increment quantity buttons for non-unique heroes that are following another hero.",
      "Added Export/Import options for the user created collection data."
    ],
    "changed": [
      "Moved the roster info drawer button from the main header to just above to warbands to make space for an account indicator."
    ],
    "bugfixes": [
      "Make sure that the PDF print out is always black on white, even in darkmode.",
      "Profile typo corrections for Smaug, the Kings of Men, and Riders of Rohan now correctly count towards the Bow Limit in Realms of Men.",
      "Fix the positioning of the Army Composition totals in the PDF print-out.",
      "Wording correction for Sauron The Necromancer profile special rule.",
      "Corrected Gandalf the White's special rule for Pippin to only appear on the PDF if Pippin is selected as an option.",
      "Corrected the Special Rules that appear in the profile of Hera, The Bride of Death.",
      "Corrected the wording of The Banner of Minas Tirith special rule on Boromir's profile.",
      "Corrected the Wounds on the trackables (PDF & Gamemode) for the Mahud Beastmaster Chieftain.",
      "Added correct comparator for sorting numerical table columns in the profile database.",
      "Corrected Gandalf's profile card for Thorin's Company to be from The Hobbit, not LotR.",
      "Shadowfax now correctly displays in Game Mode for Gandalf in Riders of Eomer.",
      "Rangers of Gondor are now correctly available to select in the Realms of Men army list."
    ],
    "security": ["Upgrade application bundler to resolve vulnerability."]
  },
  "1.11": {
    "added": ["Darkmode."],
    "changed": [
      "Removed the custom page margin on the PDF printout, which hopefully resolve some printing errors."
    ],
    "bugfixes": [
      "Make sure all rosters can benifit from the Siege Equipment and points limit",
      "Add the new metadata fields to the roster export allowing a correct reimport at a later moment or on another device.",
      "Fixed the incorrect break point value shown on the PDF view.",
      "Remove siege equipment from the list of profile cards"
    ]
  },
  "1.10": {
    "added": [
      "Allow setting a points limit on your roster so you get notified when exceeding your set maximum",
      "Make it possible to mark your roster for siege games allowing you to select siege equipment from the 'Sieges' chapter of the main rule book."
    ],
    "bugfixes": ["Corrected the profile stats for the Hill Tribes Chieftain."]
  },
  "1.9": {
    "added": [
      "A Total Might counter has been added to Game Mode.",
      "Rosters can now be searched using a filter provided at the top of the rosters view."
    ],
    "changed": [
      "Roster names are now optional when creating a new roster. If you do not provide one, a default name will be used instead."
    ],
    "bugfixes": [
      "Fixed an issue where existing Game Mode sessions from before v1.8.0 were raising an error page.",
      "Fixed an issue where the alert for resetting your Game Mode session due to a roster change would constantly appear.",
      "Fixed the styling of the Add to Collection view for mobile screen sizes.",
      "Fixed a missing special rule from Lake-town Guards."
    ]
  },
  "1.8": {
    "added": [
      "Added the ability to manage your collection of miniatures in the list builder",
      "Added a user preference setting to enable/disable warnings during roster builder based on your collection",
      "Added a warning when you reopen Game Mode after your roster was changed, allowing you to reload the Game Mode session with the updated roster."
    ],
    "bugfixes": [
      "Updated the import roster function so it respects the group which was opened when importing it."
    ]
  },
  "1.7": {
    "added": [
      "Added a option to the roster popover menu which allows duplicating a roster so you can make small edits and keep the original roster intact",
      "Added a table containing all the selectable units and their profiles including the profile cards"
    ],
    "changed": [
      "All roster summary views now use 'X dead' for broken, and 'X alive' for 25%/quartered.",
      "Troll Brutes can no longer be added as a follower in another hero's warband for Army of Gundabad.",
      "Improved the form validation for recording a new game in Match History."
    ],
    "bugfixes": [
      "Fixed the Morannon Orc Warrior options to no longer require a mandatory choice.",
      "Added a 'save image' button the pretty image to allow to be stored to the device more easily",
      "Fixed Aranarth's profile statbar values.",
      "Corrected PDF page breaks to avoid breaks occuring in the middle of rules and profiles etc.",
      "Fixed the counting of War Beasts for warband and roster unit totals, such as for War Mumaks.",
      "Cave Trolls now correctly count towards the throwing weapon limit.",
      "Fixed the plain text roster summary to better display on reddit posts/comments.",
      "Corrected the profile special rules shown for Aragorn, King Elessar.",
      "Fixed the special rules shown in the PDF print-out to correctly include any additional rules provided by the army list special rules."
    ]
  },
  "1.6": {
    "changed": [
      "Updated the look and feel on the roster summary and pretty share image. The old table can still be used by changing the user preferences."
    ],
    "bugfixes": [
      "Fixed issue with break point calculation in Game Mode and Roster Summary/Plain text view.",
      "Fixed an issue with the roster/warband unit counts for Fangorn.",
      "Corrected the point cost for an Iron Hills Chariot.",
      "Corrected a typo in the Besiegers of the Hornburg army list name.",
      "Corrected the Attack value of the War Mumak of Harad.",
      "Corrected base sizes on the profiles for Gundabad Ogre and Goblin Scribe."
    ]
  },
  "1.5": {
    "added": [
      "Reimplemented and enabled the fan favorite 'Game Mode' feature.",
      "Also updated and re-enabled the Match History screen."
    ],
    "bugfixes": [
      "Fixed an issue for the King's Guard upgrade for Rivendell Warriors in the Last Alliance",
      "Fixed the missing option for upgrading Grim Hammer Warriors to Guardians of the King in Thror's warband.",
      "Corrected the Werewolf profile card to 50mm base size.",
      "Fixed several Mordor heroes incorrectly marked as Minor Heroes.",
      "Fixed Theoden's point cost in the Ride Out army list, and a typo on Legolas' profile card.",
      "Corrected a typo for the Trample special rule found on the War Mumak of Harad's profile card.",
      "Added the missing Resistance to Magic highlight when selecting a hobbit passenger",
      "Added an missing warning for whenever too many siege engines are selected",
      "Fixed a couple of siege engines that were not counting their crew towards the bow limit.",
      "Fixed an issue where passenger options would not increase the total MWF shown in the roster information drawer (such as with Pippin riding with Gandalf)."
    ]
  },
  "1.4": {
    "added": [
      "Rosters can now be renamed and deleted from the My Rosters page.",
      "Roster groups can now be renamed, disbanded or deleted, either from the My Rosters page or within the roster group.",
      "The unit counter on a warband now indicates you have gone over the limit by recolouring the counter",
      "Added a direct link to the FAQs and Errata in the navigation"
    ],
    "changed": [
      "Navigating to a PDF printable link for a roster that doesn't exist will now inform you of such and let you go back to the My Rosters page."
    ],
    "bugfixes": [
      "Corrected profile data errors for Grima Wormtongue, Uruk-hai Scout, Uruk-hai Captain, and Nazgul of Dol Guldur.",
      "Handle the bow and throw limits for Erebor & Dale using their army special rules",
      "Fixed typos on the profiles for Faramir and Iron Hills Ballista",
      "Warbands now get renumbered after deleting a whole warband making sure there is no gaps in numbers",
      "Special rules coming from the army bonus now get properly highlighted and added to the printable PDF"
    ]
  },
  "1.3": {
    "added": [
      "All armies from the Armies of Arnor and Angmar supplement PDF have been added to the builder."
    ],
    "bugfixes": [
      "Change the breakpoint calculation so that it reflects 'more than 50%' rather than just 50%",
      "Fixed Lindir's missing magical powers from his profile.",
      "Fixed Rivendell Captains who could only be added once to your Rivendell roster",
      "Corrected a typo in Arwen's full name on her profile card.",
      "Fixed an issue for options that consist of multiple types, such as mount & throwing weapon for Horse and throwing spears",
      "Fixed an issue with Defenders of Helm's Deep where Aldor and Haleth couldn't be included in other warbands.",
      "Fixed an issue where moving units between warbands wasn't updating the roster totals correctly."
    ]
  },
  "1.2": {
    "added": [
      "Allow draging and dropping of entire warband so you can reorder them after you build your roster"
    ],
    "changed": [
      "Updated the items in the roadmap to reflect what we have done and will do next",
      "Added a suffix to the image resource urls which will force a reload upon version updates"
    ],
    "bugfixes": [
      "Fixed issue with duplicating warbands causing an error.",
      "Fixed an issue where Uruk-hai Scout options were mandatory in Muster of Isengard.",
      "Fixed an issue where the downloaded profile cards would not open.",
      "Fixed special rules not being highlighted if they have a (x) specification like Hatred.",
      "Fixed issue in Iron Hills where captains and ballistas could only be added once.",
      "Fixed a typo that resulted in an incorrect bow limit calculation for Rivendell",
      "Fix option being listed on the text view even if its not selected"
    ]
  },
  "1.1": {
    "added": [
      "Added in red overlay on follower cards when a hero is reselected which would make the follower selection invalid",
      "Readded the drag and drop utilities in roster builder allowing you to sort your models and move them between warbands"
    ],
    "changed": [
      "Removed the old jspdf library used to generate the PDF export and make use of the browser print settings to ensure we get the best PDF layout"
    ],
    "bugfixes": [
      "Fix the incorrect point display for The Three Trolls on the Mobile Toolbar, PDF and roster sharing tables",
      "Hide army list option for the The Three Trolls in the PDF if they are not selected",
      "Update the MWF trackers and badge if the Full Bellies option is selected for The Three Trolls",
      "Warriors of Dale option for Spear has been corrected to Shield, for 1 point.",
      "Uruk-hai Scout Captain in Lurt'z Scout has been corrected to a Hero of Fortitude.",
      "Corrected the statbar mistakes found on the Isengard Warg profile",
      "Fixed issue with Rangers of Ithillien where Sam and Smeagol could not be selected."
    ]
  },
  "1.0": {
    "removed": ["Removed the Work in Progress banner from the my rosters page"]
  },
  "0.3": {
    "added": [
      "Add the armies listed in the 'The Hobbit' army book to the selectable armies",
      "The Men of the West army list now shows a warning when the roster includes cavalry and eagles"
    ]
  },
  "0.2": {
    "added": [
      "Added missing keywords for Heroic Channelling, Combat, March, Move & Shoot",
      "Added toolbar with roster overview data when screensize dictates that the roster info collapses",
      "Added application settings including enable/disable roster overview toolbar option",
      "Added drag & drop in the 'My Rosters' page to group and ungroup created rosters"
    ],
    "bugfixes": [
      "Updated the server configuration to allow deeplinking to nested routes like /rosters and /about",
      "Corrected some mistakes in the datafiles including Prince Haleth's horse, Sauron's warband size and the WoMT's wargear options",
      "Fixed incorrect option list type for heroes in mobile display, allowing them only to take 1 option",
      "Allow special warband upgrade to be take aside from other wargear options",
      "Remove the Rohan Royal Guard from the unit selector in Army of Edoras where it did not belong",
      "Updated the MWF value on the War Mumak of Harad when the Beastmaster is chosen as an option",
      "Correctly remove special rules from the PDF that are linked to an option that is not selected",
      "Correctly handle 'upgrade to armoured ...' options when generating the profiles for the PDF",
      "Fix typo in the Rider of Rohan and Royal Guard special rules"
    ]
  },
  "0.1": {
    "added": ["Imported the v2018 code base into v2024"],
    "changed": [
      "Clean up v2018 related calculations and data that did not carry over to v2024",
      "Update the data files with the v2024 data for the Lord of the Rings book",
      "Update the avatar images and the profile cards for the Lord of the Rings book"
    ]
  }
}
