{
  "Arathorn's Stand": {
    "additional_rules": [
      {
        "description": "An Arathorn's Stand Army must always contain Arathorn, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "\"They’re dangerous folk, wandering the wilds\"",
        "description": "Rangers of the North increase their Attacks value to 2."
      },
      {
        "title": "Heir of Isildur",
        "description": "Whenever Arathorn spends a Might Point, roll a D6. On a 4+ the point of Might is free and does not reduce Arathorn's store of Might."
      },
      {
        "title": "Silent Ambush",
        "description": "In Scenarios where you roll for Warbands to arrive, or ones where you roll to see which part of the board you deploy a Warband in (though not when rolling to choose deployment zones), you may modify the roll for Warbands from this Army by +1 or -1."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Army of Carn Dum": {
    "additional_rules": [
      {
        "description": "An Army of Carn Dum must always contain Aldrac, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "Show of Strength",
        "description": "If a Carn Dum Hero slays one or more enemy models in Combat, then for the duration of the following turn they gain a bonus of +1 to their Fight Value."
      },
      {
        "title": "Banners of Carn Dum",
        "description": "Friendly banners have a range of 6\" rather than 3\"."
      },
      {
        "title": "Fierce Charge",
        "description": "Friendly Warrior models gain a bonus of +1 to their Fight Value in a turn in which they Charge."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Army of Dale": {
    "additional_rules": [
      {
        "description": "An Army of Dale Army must always contain Brand, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "Skilled Bowmen",
        "description": "Friendly Dale models improve their Shoot Value to 3+."
      },
      {
        "title": "Protect the King",
        "description": "Friendly models gain the Sworn Protector (Brand) special rule."
      },
      {
        "title": "Stoic Defence",
        "description": "Once per game, at the start of any Move Phase before the Declare Heroic Actions step, you may declare you are using this ability. If you do, then during the Move Phase friendly models cannot Move during their Activation (but can otherwise act normally). Additionally, until the End Phase of the turn, friendly models gain the Dominant (2) special rule and may re-roll any failed To Wound Rolls when making Strikes."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Sworn Protector (Brand)",
      "Dominant (2)"
    ]
  },
  "Army of Dunland": {
    "additional_rules": [
      {
        "description": "An Army of Dunland Army must always contain Thrydan, who is always the Army's General"
      }
    ],
    "special_rules": [
      {
        "title": "\"Death to the Forgoil!\"",
        "description": "Friendly Dunland models gain the Hatred (Rohan) special rule."
      },
      {
        "title": "Dunlending Pride",
        "description": "Friendly banners have a range of 6\" rather than 3\"."
      },
      {
        "title": "Dunlending War Cry",
        "description": "Once per game, at the start of any Fight Phase, Thrydan can use this special rule so long as he is alive and on the battlefield. If he does, then until the end of the turn friendly Dunland models within 12\" of Thrydan gain a bonus of +1 To Wound when making Strikes."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Hatred (X)"
    ],
    "legacy": true
  },
  "Army of Edoras": {
    "additional_rules": [
      {
        "description": "Riders of Rohan do not count towards this Army's Bow Limit."
      }
    ],
    "special_rules": [
      {
        "title": "\"Forth Eorlingas!\"",
        "description": "Once per game, at the start of any Fight Phase, your General can use this special rule if they Charged in the preceding Move Phase. If they do, then until the end of the turn friendly Rohan models within 12\" of your General must re-roll all failed To Wound Rolls when making Strikes."
      },
      {
        "title": "Protect the King",
        "description": "When a friendly Rohan Hero Charges, until the end of the turn friendly Rohan Warrior models within 6\" of them will automatically pass all Courage Tests they are required to take for Charging an enemy with the Terror special rule."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Army of Erebor": {
    "additional_rules": [
      {
        "description": "Friendly Dwarf models gain the Erebor keyword."
      }
    ],
    "special_rules": [
      {
        "title": "Wall of Steel",
        "description": "Friendly models that are Supporting gain a bonus of +1 To Wound when making Strikes."
      },
      {
        "title": "\"For Erebor!\"",
        "description": "Each friendly Hero model may, once per game, declare a Heroic Combat for free."
      },
      {
        "title": "Like Father, Like Son",
        "description": "Whilst within 3\" of each other, Gimli and Glóin may re-roll any failed To Wound Rolls when making Strikes."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Army of Gothmog": {
    "additional_rules": [
      {
        "description": "The Army of Gothmog must always contain Gothmog, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "Tyrannical Rule",
        "description": "Friendly Orc Hero models may benefit from Gothmog's Stand Fast."
      },
      {
        "title": "Ruthless Assault",
        "description": "Friendly Orc models may re-roll To Wound rolls of a natural 1 when making Strikes against a Trapped model."
      },
      {
        "title": "The Destruction of Men",
        "description": "The range of Gothmog's \"The Age of Men is Over\" special rule is increased to 12\". Additionally, the range of Gothmog's \"The Time of the Orc has come\" special rule is increased to battlefield wide."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Army of Gundabad": {
    "additional_rules": [],
    "special_rules": [
      {
        "title": "Commander of Legions",
        "description": "If your General is either Azog or Bolg, then your General gains the Master of Battle (5+) special rule."
      },
      {
        "title": "\"Here ends your filthy bloodline!\"",
        "description": "Azog may re-roll any failed To Wound Rolls when making Strikes against Erebor models."
      },
      {
        "title": "The Horn of Gorgoroth",
        "description": "Once per game, after Priority has been determined, as long as your General is alive and on the battlefield they can order the Horn of Gorgoroth to be blown. Until the End of the turn, all friendly Gundabad models gain a bonus of +2 to any Courage Tests they are required to take. Additionally, until the end of the turn, all enemy models on the battlefield suffer a -2 penalty to any Courage Tests they are required to take. Note that this is not cumulative with other rules that confer similar penalties."
      },
      {
        "title": "Raise the Banners",
        "description": "During the Priority Phase, after Priority has been determined, as long as your General is alive and on the battlefield they may command one of the banners on the signal tower to be raised. If they do, choose one of the banners below and apply its effects until the End Phase of the turn. You may not raise the same banner as the previous turn.\n\nThe Banner of Dol Guldur - All friendly Gundabad models on the battlefield count themselves as being in range of a banner.\n\nThe Banner of Gundabad - All friendly Gundabad Hero models on the battlefield may declare a Heroic March for free.\n\nThe Banner of Angmar - Whenever a friendly Gundabad model suffers a Wound, roll a D6. On the roll of a natural 6, the Wound is ignored. Gundabad Berserkers will instead pass their Oblivious to Pain roll on a natural 5+ instead of a natural 6."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Army of Lake-town": {
    "additional_rules": [
      {
        "description": "Bard's Family may be included in Tauriel's Warband rather than Bard's if you wish."
      },
      {
        "description": "Lake-town Guard may only be included in the Warbands of Lake-town Hero models."
      }
    ],
    "special_rules": [
      {
        "title": "The Master's Coin",
        "description": "At the end of his Activation if he is within 3\" of Braga, the Master of Lake-town may spend a Will Point. If he does, Braga immediately regains a Will Point spent earlier in the battle."
      },
      {
        "title": "Air of Self-importance",
        "description": "The Master of Lake-town, Alfrid and Braga may not take part in any Heroic Action declared by Bard or a member of Bard's Family."
      },
      {
        "title": "\"I Shall Protect You\"",
        "description": "Tauriel may include Kili, Fili, Bofur and Óin in her Warband. Additionally, if Tauriel is within 3\" of a friendly Dwarf model who is Engaged in Combat, she gains a bonus of +1 To Wound when making Strikes."
      },
      {
        "title": "Stubborn to a Fault",
        "description": "Friendly Dwarf models may re-roll failed To Wound Rolls either when making a shooting attack or when making Strikes."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Army of the Great Eye": {
    "additional_rules": [
      {
        "description": "An Army of the Great Eye must always contain a Ringwraith model as the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "The Great Eye",
        "description": "At the beginning of the game, place a 25mm Great Eye Marker on the battlefield in your deployment zone. At the end of each Move Phase, remove the Great Eye Marker and roll a D6. On a 2+ you may place it anywhere within 6\" of where it was. On a 1, Sauron has been distracted and your opponent may place it anywhere within 12\" of where it was. The Great Eye Marker can never be placed so that it overlaps another model's base, though models may finish their Move overlapping the Great Eye Marker. Friendly models treat the Great Eye Marker as a banner. Enemy models within 3\" of the Great Eye Marker suffer a -1 penalty to any Courage or Intelligence Tests they are required to take.\nIf your opponent's Army contains a Ringbearer (with the exception of Sauron), then if during the End Phase of any turn they are wearing the Ring and within 3\" of the Great Eye Marker, they must roll a D6. On a 3+, they succumb to Sauron and are immediately removed as a casualty."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Army of the White Hand": {
    "additional_rules": [],
    "special_rules": [
      {
        "title": "Serve the White Wizard",
        "description": "Other friendly models that can draw Line of Sight to Saruman gain a bonus of +1 to any Courage Tests they are required to take."
      },
      {
        "title": "The Voice of Saruman",
        "description": "During his Activation, Saruman can use one of the following abilities instead of Casting a Magical Power. Each of these abilities can only be used once per game.\n\nConjure Lightning – Choose a point on the battlefield at least 12\" away from any friendly model (with the exception of Grima Wormtongue). Each model within 2\" of the chosen point suffers a Strength 6 hit. If a Cavalry model is affected, both the rider and Mount will suffer a Strength 6 hit.\n\nSummon Gale – Until the end of the turn, enemy models halve their Move Value.\n\nCall Thunder – Until the end of the turn, enemy models have the Fearful special rule."
      },
      {
        "title": "Spies of Saruman",
        "description": "Saruman can draw Line of Sight from any friendly Crebain models on the battlefield."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Fearful"
    ]
  },
  "Army of Thror": {
    "additional_rules": [],
    "special_rules": [
      {
        "title": "Thror ruled with utter surety",
        "description": "Friendly Erebor models treat Thror as a banner with a range of 6\"."
      },
      {
        "title": "Erebor Treasure Hoard",
        "description": "Friendly Erebor models gain a bonus of +1 To Wound when making Strikes against an enemy model that is in possession of an Objective Marker. Additionally, Friendly Erebor models that are within their deployment zone may re-roll To Wound Rolls of a natural 1 when making Strikes."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Arnor": {
    "additional_rules": [
      {
        "description": "An Arnor Army must always contain Arvedui, who is always the Army's General."
      },
      {
        "description": "Friendly Rangers of the North gain the Arnor keyword."
      }
    ],
    "special_rules": [
      {
        "title": "Defend the King",
        "description": "Whilst within 6\" of Arvedui, friendly Arnor models automatically pass any Courage Tests they are required to take."
      },
      {
        "title": "Power of the Seer",
        "description": "Friendly Arnor Hero models receive a bonus of +1 when rolling for Malbeth's Gift of Foresight special rule."
      },
      {
        "title": "Seeing Stones",
        "description": "Once per game, during the Priority Phase but before the roll for Priority, Arvedui can use this special rule so long as he is alive and on the battlefield. If he does, Arvedui's controlling player automatically wins the roll to choose who has Priority for that turn. If both sides have a special rule allowing them to do this and both wish to use it in the same turn, players roll off as normal and both special rules count as being used."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Assault on Lothlorien": {
    "additional_rules": [
      {
        "description": "An Assault on Lothlórien Army must always contain Muzgúr, who is always the Army's General."
      },
      {
        "description": "An Assault on Lothlórien Army must always contain at least one Unique Goblin Hero."
      },
      {
        "description": "Spider models may only be included in either Drûzhag’s or Ashrâk’s Warbands."
      },
      {
        "description": "This Army may not include more Goblin models than Orc models."
      }
    ],
    "special_rules": [
      {
        "title": "Cover of Darkness",
        "description": "Any game using this Army List automatically takes place at night. Use the Fighting at Night special rules found on page 137 of the Middle-earth Strategy Battle Game Rules Manual."
      },
      {
        "title": "Ruthless Savagery",
        "description": "Friendly Orc and Goblin models gain a bonus of +1 To Wound when making Strikes against an enemy model that is outnumbered in a Combat."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [],
    "legacy": true
  },
  "Assault on Ravenhill": {
    "additional_rules": [
      {
        "description": "An Assault on Ravenhill Army must include Thorin, who is always the Army's General."
      },
      {
        "description": "An Assault on Ravenhill Army is always deployed as a single Warband with Thorin as the Warband's Captain."
      }
    ],
    "special_rules": [
      {
        "title": "Orcrist",
        "description": "Legolas begins the game with Orcrist - no points are paid for Orcrist, it is free. Additionally, at the start of any Fight Phase, if Legolas is within 6\" of Thorin and Thorin is Engaged in Combat, then Legolas can throw Orcrist to Thorin. From that point on, Thorin carries Orcrist instead of Legolas."
      },
      {
        "title": "The Line of Durin",
        "description": "Friendly models treat Thorin as a banner with a range of 6\". So long as he is still alive, Thorin will count as a banner for the purpose of Victory Points in Scenarios that award Victory Points for having a banner left alive. Additionally, Kili and Fili increase their Attacks to 3 in this Army List"
      },
      {
        "title": "The King's Protector",
        "description": "If Thorin is Engaged in Combat within 6\" of Dwalin, then Dwalin may declare a Heroic Combat for free. If the Heroic Combat is successful then Dwalin must use the following Move to join Thorin's Combat. If this is not possible then Dwalin must Move as close as possible to Thorin."
      },
      {
        "title": "Heroes of Mirkwood",
        "description": "Legolas increases his Fight Value to 7 and his Attacks to 3. Additionally, Tauriel must re-roll all failed To Wound Rolls when making Strikes."
      },
      {
        "title": "Throwing Stones",
        "description": "Instead of using his Throw Stones special rule as normal, Bilbo may use stones in the same way as a Throwing Weapon. These have a Strength of 1 and a range of 8\", and Bilbo may re-roll any failed To Wound Rolls when using stones as a Throwing Weapon."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Assault Upon Helm's Deep": {
    "additional_rules": [
      {
        "description": "An Assault Upon Helm's Deep Army must always contain an Uruk-hai Captain, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "\"You do not know pain, you do not know fear\"",
        "description": "The Break Point for an Assault Upon Helm's Deep Army is 66% rather than 50%."
      },
      {
        "title": "Commander of the Uruk-hai",
        "description": "The Uruk-hai Captain that is your General increases its Attacks and Wounds to 3 each."
      },
      {
        "title": "Break the Walls",
        "description": "Friendly Isengard Assault Ballistae may re-roll To Hit and Scatter Rolls of a 1. Additionally, when a friendly Demolition Charge is detonated, you may roll two dice on the Detonation Table rather than one and pick either result."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "break_point": 0.66,
    "rule_highlights": []
  },
  "Atop the Walls": {
    "additional_rules": [
      {
        "description": "An Atop the Walls Army must include Gandalf the White, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "\"Fight to the last Man\"",
        "description": "Friendly Gondor models within 12\" of Gandalf the White automatically pass any Courage tests they have to make."
      },
      {
        "title": "\"Return to your posts\"",
        "description": "Friendly Gondor models within range of an Objective Marker may re-roll To Wound rolls of a natural 1 when making shooting attacks or making Strikes."
      },
      {
        "title": "\"Send these foul creatures into the abyss\"",
        "description": "Friendly Gondor models within 12\" of Gandalf the White gain the Hatred (Mordor) special rule."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Azog's Hunters": {
    "additional_rules": [],
    "special_rules": [
      {
        "title": "Morgul Arrows",
        "description": "Any enemy model that suffers a Wound from a shooting attack made by a friendly model, and that Wound isn't prevented, must roll a D6 during the End Phase of every turn after suffering the Wound. On the roll of a 1, the model immediately suffers a Wound. A model that has suffered multiple Wounds in this manner still only rolls a single D6 during the End Phase."
      },
      {
        "title": "\"They Strike in the wee small hours when everyone's asleep\"",
        "description": "An Azog's Hunters Army has a Bow Limit of 50% rather than the usual 33%."
      },
      {
        "title": "Relentless Hunters",
        "description": "All models in this army list gain the Woodland Creature and Mountain Dweller special rules."
      },
      {
        "title": "The Pale Orc's Demands",
        "description": "Whilst within 6\" of a friendly Hero, friendly Orc Warrior models gain a bonus of +1 to any Courage Tests to Charge an enemy model with the Terror special rule."
      }
    ],
    "bow_limit": 0.5,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Mountain Dweller",
      "Woodland Creature"
    ]
  },
  "Barad-dur": {
    "additional_rules": [
      {
        "description": "A Barad-dur Army must always contain Sauron, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "\"The power of the Ring could not be undone\"",
        "description": "So long as Sauron has at least 3 Wounds remaining a Barad-dUr Army can never count as being Broken. Should Sauron have 2 or fewer Wounds remaining, a Barad-dûr Army will Break as normal. However, should Sauron ever be removed as a casualty, a Barad-dur Army will immediately count as being Broken."
      },
      {
        "title": "Teeming with Orcs",
        "description": "Sauron's Warband may include 24 models rather than the usual 18 for a Hero of Legend."
      },
      {
        "title": "Victory is at hand",
        "description": "So long as Sauron is alive and on the battlefield friendly Orc models gain a +1 bonus to any Courage Tests they are required to take."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Battle of Bywater": {
    "additional_rules": [
      {
        "description": "A Battle of Bywater Army must include Frodo, Sam, Merry and Pippin. Merry must always be the Army's General."
      },
      {
        "description": "Hobbit Militia in Merry's Warband must be upgraded to Battlin' Brandybucks."
      },
      {
        "description": "Any Hobbit Archers in a Warband led by either Pippin or Paladin must be upgraded to Tookish Hunters."
      }
    ],
    "special_rules": [
      {
        "title": "Ambush!",
        "description": "At the start of the game, before either side has deployed, you may choose a single Warband in your Army that is not led by either Frodo, Sam, Merry or Pippin. The chosen Warband is ambushing and does not arrive as normal. Instead, at the end of the Move Phase on the third turn (after both sides have moved all their models), the ambushing Warband must choose one of the following:\n• Move onto the board from any board edge via the rules for Reinforcements.\n• Deploy in, or within 1\" of, a wood, building, rocky outcrop or other similar piece of terrain that Hobbits could hide in. A degree of common sense is required when deciding which pieces of terrain Hobbits can hide in - they shouldn't be leaping out of a river or from behind a single rock! You should always agree with your opponent at the beginning of the game which terrain pieces are eligible for Hobbits to ambush from. Models deployed in this way cannot be placed in base contact with, or within the Control Zones of, enemy models. Models that enter the board in this way do not Activate as part of the Move Phase, and will count as having Moved half their Move Value for the purposes of shooting."
      },
      {
        "title": "\"Fear! Fire! Foes!\"",
        "description": "Friendly Hobbit models gain the Woodland Creature and Mountain Dweller special rules."
      },
      {
        "title": "Heroes of the Shire",
        "description": "Friendly Hobbit Hero models may benefit from the Stand Fast of either Merry or Pippin."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Battle of Fornost": {
    "additional_rules": [
      {
        "description": "A Battle of Fornost Army must always contain Earnur and Glorfindel. Earnur must always be the Army's General."
      },
      {
        "description": "Gondor Warrior models can only be included in the Warband of a Gondor Hero."
      },
      {
        "description": "Rivendell Warrior models can only be included in the Warband of a Rivendell Hero."
      },
      {
        "description": "Hobbit Warrior models can only be included in the Warband of a Dúnedain Hero."
      },
      {
        "description": "Rangers of the North can instead be taken as Independent Heroes; however, if they are then the only Hero whose Warband they can be included in is Aranarth."
      }
    ],
    "special_rules": [
      {
        "title": "The Charge of Gondor",
        "description": "Friendly Gondor Cavalry models gain a bonus of +1 to their Fight Value on a turn in which they Charge."
      },
      {
        "title": "Power of the Elves",
        "description": "Friendly models gain the Resistant to Magic special rule."
      },
      {
        "title": "Earnur's Defiance",
        "description": "Earnur cannot have his Courage reduced by enemy special rules or Magical Powers."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Resistant to Magic"
    ]
  },
  "Battle of Greenfields": {
    "additional_rules": [
      {
        "description": "A Battle of Greenfields Army must always contain Bandobras Took, who is always the Army’s General."
      }
    ],
    "special_rules": [
      {
        "title": "The Bullroarer",
        "description": "Bandobras Took may declare a Heroic Combat each turn for free."
      },
      {
        "title": "\"They’re dangerous folk, wandering the wilds\"",
        "description": "Rangers of the North increase their Attacks value to 2."
      },
      {
        "title": "\"Defend the Shire!\"",
        "description": "Friendly Hobbit Warrior models within 3\" of Bandobras gain the Dominant (2) special rule."
      },
      {
        "title": "The Bounders",
        "description": "Whilst wholly within their own deployment zone, friendly Hobbit models may re-roll To Hit rolls of a natural 1 when making shooting attacks."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Dominant (2)"
    ],
    "legacy": true
  },
  "Beseigers of the Hornburg": {
    "additional_rules": [
      {
        "description": "A Besiegers of the Hornburg Army must include Wulf, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "Wulf's Revenge",
        "description": "Whenever Wulf Moves, he must always Charge an enemy model if possible. Additionally, once per game Wulf may declare a Heroic Challenge for free, though this Heroic Challenge must target the enemy General. Wulf may still do this even if the enemy General has a lower Heroic Tier."
      },
      {
        "title": "The Promise of Wealth",
        "description": "Friendly Dunland Warrior models within range of an Objective Marker gain a bonus of +1 To Wound when making Strikes."
      },
      {
        "title": "Shank & Wrot",
        "description": "Friendly Mordor models cannot benefit from the Heroic Actions or Stand Fast of friendly Dunland models and friendly Dunland models cannot benefit from the Heroic Actions or Stand Fast of friendly Mordor models."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Besiegers of the Hornburg": {
    "additional_rules": [
      {
        "description": "A Besiegers of the Hornburg Army must include Wulf, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "Wulf's Revenge",
        "description": "Whenever Wulf Moves, he must always Charge an enemy model if possible. Additionally, once per game Wulf may declare a Heroic Challenge for free, though this Heroic Challenge must target the enemy General. Wulf may still do this even if the enemy General has a lower Heroic Tier."
      },
      {
        "title": "The Promise of Wealth",
        "description": "Friendly Dunland Warrior models within range of an Objective Marker gain a bonus of +1 To Wound when making Strikes."
      },
      {
        "title": "Shank & Wrot",
        "description": "Friendly Mordor models cannot benefit from the Heroic Actions or Stand Fast of friendly Dunland models and friendly Dunland models cannot benefit from the Heroic Actions or Stand Fast of friendly Mordor models."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Breaking of the Fellowship": {
    "additional_rules": [
      {
        "description": "A Breaking of the Fellowship Army must include Aragorn, Strider who is always the Army's General."
      },
      {
        "description": "All Fellowship models must be included in Aragorn's Warband."
      },
      {
        "description": "Lothlórien Warriors can only be included in a Warband led by Haldir."
      }
    ],
    "special_rules": [
      {
        "title": "Gifts of Galadriel",
        "description": "Each Fellowship model will gain the Wargear listed next to their name below, which have the effects detailed:\n\nFrodo - Light of Earendil - ACTIVE - At the start of each of his Activations, Frodo may roll a D6. On a 3+, Frodo counts as having Cast the Blinding Light Magical Power.\nSam - Elven Rope - ACTIVE - Sam always counts as rolling a 6 for any Climb, Leap or Jump Tests he is required to make.\nMerry & Pippin - Daggers of the Noldorin - ACTIVE - These are Elven hand weapons. Whilst wielding these weapons, Merry and Pippin may re-roll failed To Wound rolls when making Strikes.\nAragorn - Elven Dagger - ACTIVE - This is an Elven hand weapon with the Uruk-haibane special rule.\nLegolas - Bow of the Galadhrim - ACTIVE - Whilst within 3\" of a friendly Lothlórien model, Legolas may re-roll failed To Hit rolls when making shooting attacks.\nGimli - Galadriel's Locks - ACTIVE - Gimli may use this Wargear to re-roll a single D6 in a Duel Roll. Gimli may only use this Wargear three times during the course of the game.\nBoromir - Golden Belt - ACTIVE - Boromir gains the Woodland Creature special rule."
      },
      {
        "title": "\"You have my sword\"",
        "description": "So long as Frodo is alive and on the battlefield, friendly Fellowship models gain the Fearless special rule. Additionally, a Breaking of the Fellowship Army can never be considered Broken whilst Frodo is alive, even if he escapes the battlefield in Scenarios where this applies."
      },
      {
        "title": "Blessing of Galadriel",
        "description": "Friendly models count as being under the effects of the Fortify Spirit Magical Power, even if they have no Will Points remaining."
      },
      {
        "title": "Shielded from Unfriendly Eyes",
        "description": "Friendly Hero models gain an Elven cloak for free."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Fearless",
      "Woodland Creature"
    ]
  },
  "Buhrdur's Horde": {
    "additional_rules": [
      {
        "description": "A Buhrdur's Horde Army must always contain Buhrdur, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "Ambush!",
        "description": "At the start of the game, before either side has deployed, you may choose to have Buhrdûr's Warband ambushing and not arrive as normal (if your General must deploy at the start of the game, you cannot use this ability). Instead, at the end of the Move Phase on the third turn (after both sides have moved all their models), the ambushing Warband must choose one of the following:\n\nMove onto the board from any board edge via the rules for Reinforcements.\n\nDeploy in, or within 1\" of, a wood, building, rocky outcrop or other similar piece of terrain that the models could hide in. A degree of common sense is required when deciding which pieces of terrain the Warband can hide in — they shouldn't be leaping out of a river or from behind a single rock! You should always agree with your opponent at the beginning of the game which terrain pieces are eligible to ambush from. Models deployed in this way cannot be placed in base contact with, or within the Control Zones of, enemy models. Models that enter the board this way do not Activate as part of the Move Phase, and will count as having Moved half their Move Value for the purposes of shooting."
      },
      {
        "title": "Masters of Terrain",
        "description": "Friendly models gain the Woodland Creature and Mountain Dweller special rules."
      },
      {
        "title": "A Fearsome Foe",
        "description": "If Buhrdur kills an enemy Hero in Combat, he gains the Fearless special rule for the remainder of the game."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Fearless",
      "Mountain Dweller",
      "Woodland Creature"
    ]
  },
  "Cirith Ungol": {
    "additional_rules": [
      {
        "description": "A Cirith Ungol Army must always contain Shagrat and Gorbag; Shagrat must always be your General."
      },
      {
        "description": "Orc Warrior models can only be included in the Warband of an Orc Hero."
      },
      {
        "description": "Uruk-hai Warrior models can only be included in the Warband of an Uruk-hai Hero."
      }
    ],
    "special_rules": [
      {
        "title": "Animosity",
        "description": "Friendly Orc models gain a bonus of +1 To Wound when making Strikes if there is a friendly Uruk-hai model Engaged in the same Combat. Friendly Uruk-hai models gain a bonus of +1 To Wound when making Strikes if there is a friendly Orc model Engaged in the same Combat."
      },
      {
        "title": "Rivals for Power",
        "description": "Keep track of how many models Gorbag and Shagrat have each killed. If at any point either of them has fewer kills than the other, that model may re-roll a single D6 during a Duel Roll."
      },
      {
        "title": "Swift Hunter",
        "description": "During the declare Heroic Actions step of the Move Phase, Shelob can choose to kill a friendly model within 1\" of her - remove the chosen model as a casualty. If she does, Shelob may declare a Heroic Move for free, though she may not shout With Me as part of this Heroic Move."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Corsair Fleet": {
    "additional_rules": [
      {
        "description": "A Corsair Fleets Army must always contain a Corsair Captain, who is always the Army's General."
      },
      {
        "description": "If your army contains Dalamyr, then he will always be the Army's General, instead of a Corsair Captain."
      }
    ],
    "special_rules": [
      {
        "title": "The Fleetmaster",
        "description": "The Corsair Captain that is your General increases their Attacks and Wounds to 3 each, and gains the Fearless and Sharpshooter special rules."
      },
      {
        "title": "The Last Stroke of Doom",
        "description": "Friendly Corsair models gain the Backstabbers special rule."
      },
      {
        "title": "Ballistae Assault",
        "description": "After both sides have been deployed, but before the first turn of the game a single Corsair Ballista may make a shooting attack following all the normal rules for doing so."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Backstabbers",
      "Fearless",
      "Sharpshooter"
    ]
  },
  "Defenders of Erebor": {
    "additional_rules": [
      {
        "description": "A Defenders of Erebor Army must always include at least one Unique Erebor Hero, and at least one Unique Dale Hero."
      },
      {
        "description": "Erebor Warrior models can only be included in the Warband of a Erebor Hero."
      },
      {
        "description": "Dale Warrlor models can only be included in the Warband of a Dale Hero."
      },
      {
        "description": "Any models with the Iron Hills keyword replace it with the Erebor keyword."
      }
    ],
    "special_rules": [
      {
        "title": "Long-standing Alliance",
        "description": "Friendly Dale models within 1\" of a friendly Erebor model may re-roll To Wound Rolls of a natural 1 when making Strikes. Friendly Erebor models within 1\" of a friendly Dale model may re-roll To Wound Rolls of a natural 1 when making Strikes."
      },
      {
        "title": "A Bond Forged in War",
        "description": "At the beginning of the Fight Phase, at the start of the Declare Heroic Actions step, if either Dáin or Brand would be considered Trapped then the other may declare a Heroic Combat for free. If this Heroic Combat is successful, then Dáin or Brand must use the following Move to join the other's Combat. If this is not possible, then Dáin or Brand must Move as close as possible to the other. A model cannot use this special rule if they are in the same Combat as the other."
      },
      {
        "title": "The Heirs to the Kingdoms",
        "description": "At the beginning of the Fight Phase, at the start of the Declare Heroic Actions step, if either Thorin or Bard would be considered Trapped then the other may declare a Herolc Combat for free. If this Heroic Combat is successful, then Thorin or Bard must use the following Move to Join the other's Combat. If this is not possible, then Thorin or Bard must Move as close as possible to the other. A model cannot use this special rule if they are in the same Combat as the other."
      },
      {
        "title": "Royal Bloodlines",
        "description": "Friendly models treat each of Dáin, Thorin, Brand and Bard as a banner."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Defenders of Helm's Deep": {
    "additional_rules": [
      {
        "description": "A Defenders of Helm's Deep Army must include Théoden, King of Rohan, who is always the Army's <b>General</b>."
      },
      {
        "description": "Only a maximum of 33% of the models in this Army may have the <b>Lothlórien</b> keyword."
      }
    ],
    "special_rules": [
      {
        "title": "Allies 'til the End",
        "description": "Haldir treats both Aragorn and Théoden as a banner with a range of 6\". Additionally, whilst within 6\" of either Aragorn or Théoden, Haldir automatically passes all Courage Tests and may re-roll failed To Wound Rolls when making Strikes."
      },
      {
        "title": "\"Fall Back to the Keep!\"",
        "description": "If this Army is Broken, friendly <b>Warrior</b> models gain a bonus of +1 to any Courage Tests they are required to take. Additionally, if this Army is Broken, friendly <b>Warrior</b> models within 6\" of Théoden may re-roll failed Courage Tests."
      },
      {
        "title": "\"Give them a Volley\"",
        "description": "Friendly models increase the range of their shooting attacks by 6\", provided they have not moved that turn. This special rule does not apply to throwing weapons."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Defenders of the Hornburg": {
    "additional_rules": [
      {
        "description": "Helm Hammerhand may not include any Warrior models in his Warband."
      }
    ],
    "special_rules": [
      {
        "title": "Defend the Hornburg",
        "description": "Friendly Rohan Infantry gain the Dominant (2) special rule."
      },
      {
        "title": "A Desperate Defence",
        "description": "Friendly Rohan Infantry Warrior models must re-roll To Wound Rolls of a natural 1 when making Strikes."
      },
      {
        "title": "Frenzy of the King",
        "description": "At the start of the End Phase of a turn in which Helm Hammerhand kills an enemy Hero or Monster, enemy models within 3\" of Helm must take a Courage Test in an order chosen by Helm's controlling player. If the test is failed, the model must Move up to its Move Value directly away from Helm."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Defenders of the Pelennor": {
    "additional_rules": [
      {
        "description": "Rohan Warrior models can only be included in the Warband of a Rohan Hero."
      },
      {
        "description": "Gondor Warrior models can only be included in the Warband of a Gondor Hero or Gandalf the White."
      },
      {
        "description": "Dunharrow Warrior models can only be included in the Warband of a Dunharrow Hero, or in the Warband of Aragorn, Legolas or Gimli."
      }
    ],
    "special_rules": [
      {
        "title": "Defend the White City",
        "description": "Each Hero in your Army can, once per game, declare a Heroic Combat for free."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Depths of Moria": {
    "additional_rules": [],
    "special_rules": [
      {
        "title": "Drums in the Deep",
        "description": "Enemy models suffer a -1 penalty to any Courage Tests they are required to take, whilst friendly Moria Goblin models gain a bonus of +1 to any Courage Tests they are required to take. Additionally, friendly Moria Goblin models always count as being in range of a banner."
      },
      {
        "title": "Dominion of the Balrog",
        "description": "Friendly Moria Goblin models within 6\" of the Balrog gain a bonus of +1 to their Fight Value. Additionally, so long as the Balrog has at least 6 Wounds remaining, a Depths of Moria Army can never count as being Broken. Should the Balrog have 5 or fewer Wounds remaining, a Depths of Moria Army will Break as normal. However, should the Balrog ever be removed as a casualty, a Depths of Moria Army will immediately count as being Broken."
      },
      {
        "title": "Shadow...",
        "description": "Shooting attacks that target the Balrog will only ever hit on the roll of a 5+."
      },
      {
        "title": "...and Flame",
        "description": "Once per game, at the start of any Shoot Phase, the Balrog may select a single enemy model within 3\" of it and roll a D6. On a 2+, the model is immediately Set Ablaze. This is an Active ability belonging to the Balrog, and after it has used this ability, the Balrog no longer benefits from the 'Shadow...' special rule."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Set Ablaze"
    ]
  },
  "Desolator of the North": {
    "additional_rules": [
      {
        "description": "A Desolator of the North Army must always include Smaug, who is always the Army's General - otherwise, there wouldn't be any models in your Army!"
      }
    ],
    "special_rules": [
      {
        "title": "Sheer Dominance",
        "description": "Whilst Smaug is in range of an Objective Marker he is automatically considered to be holding it and the opposition are considered to have no models within range of the Objective Marker. If models from both sides have a special rule that confers this effect, then this special rule will override the opposing one, regardless of what the opposing special rule states."
      },
      {
        "title": "Lust for Gold",
        "description": "In Scenarios where models can carry Objective Markers then when Smaug Moves, he must always Charge an enemy model carrying an Objective Marker if possible. If there are multiple enemy models carrying an Objective Marker that he can Charge, Smaug may choose which one he Charges."
      },
      {
        "title": "\"I will not part with a single coin!\"",
        "description": "At the start of each game, after both sides have been deployed, Smaug's opposing player must select three of their models to each be given a stash of gold - these must be different models. These models are given a Gold Marker, which is a Light Object that can never be passed to another model, and are treated as Objective Markers for the purpose of the Lust for Gold special rule. If Smaug kills an enemy model with a Gold Marker in Combat, then he immediately regains the Gold Marker and it is removed from the game. If a model holding a Gold Marker is slain in any other manner, the Gold Marker drops like any other Light Object and may be picked up by another model; if this is Smaug, it will be removed from play. At the end of the game, if Smaug has reclaimed all three Gold Markers then he will score an additional 2 Victory Points. However, if any Gold Markers are in the possession of an enemy model, then Smaug's opposing player will score an additional 2 Victory Points. In either instance, this can never take an Army's total number of Victory Points above 20."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Dragons of the North": {
    "additional_rules": [
      {
        "description": "A Dragons of the North Army must always contain a Dragon as the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "The Dragons' Hoard",
        "description": "Each time a friendly model slays an enemy model in Combat they may roll a D6. On a natural 6, they have located some gold upon the body of the fallen and claimed it for themselves - keep a note of how much gold each model claims in this way. Friendly models gain the following benefits depending on how much gold they have collected. These benefits are cumulative:\n1 gold - The model may re-roll a single To Wound Roll when making Strikes.\n2-3 gold - The model may re-roll a single D6 during a Duel Roll.\n4-5 gold - The model gains the Fearless special rule.\n6+ gold - At the end of the game, their controlling player will gain an additional 1 Victory Point. This can never take this Army's total number of Victory Points above 20."
      },
      {
        "title": "Beast of Legend",
        "description": "The Dragon that is your General may select up to three options rather than the usual two."
      },
      {
        "title": "Supreme Jealousy",
        "description": "Each Dragon in your Army must have a different combination of options. Dragons that have no options do not count for the purpose of this special rule."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Fearless"
    ]
  },
  "Erebor & Dale": {
    "additional_rules": [
      {
        "description": "An Erebor & Dale Army must include Girion and at least one Unique Erebor Hero."
      },
      {
        "description": "Erebor Warrior models can only be included in the Warband of an Erebor Hero."
      },
      {
        "description": "Dale Warrior models can only be included in the Warband of a Dale Hero."
      },
      {
        "description": "Ignore the usual rules for Bow Limit and Throwing Weapon Limit in this Army List. Instead, a maximum of 50% of your Dale Warrior models can have a bow, and a maximum of 50% of your Erebor Warrior models can have throwing weapons."
      }
    ],
    "special_rules": [
      {
        "title": "Alliance of Men and Dwarves",
        "description": "Friendly Dale models may re-roll To Wound Rolls of a natural 1 when making Strikes if there is a friendly Erebor model Engaged in the same Combat. Friendly Erebor models may re-roll To Wound Rolls of a natural 1 when making Strikes if there is a friendly Dale model Engaged in the same Combat."
      },
      {
        "title": "Lords of the Kingdoms",
        "description": "Friendly Dale models treat Girion as a banner. Friendly Erebor models treat Thrór as a banner."
      },
      {
        "title": "Great Prosperity",
        "description": "Whenever a friendly Hero model spends a Might Point, roll a D6. On a natural 6, the Might Point was free and does not reduce the Hero model's store of Might."
      }
    ],
    "bow_limit": 0.5,
    "throw_limit": 0.5,
    "rule_highlights": []
  },
  "Erebor Reclaimed": {
    "additional_rules": [],
    "special_rules": [
      {
        "title": "\"The Dwarves, they're rallying\"",
        "description": "Any Infantry Hero in this Army may declare a Heroic March, even if it is not listed as one of their Heroic Actions. Additionally, Infantry models in this Army list can still charge after participating in a Heroic March."
      },
      {
        "title": "Family Ties",
        "description": "The Dwarves of Thorin's Company are divided into Family Groups, which are as follows:\nBalin and Dwalin.\nKili and Fili.\nBifur, Bofur and Bombur.\nOri, Nori and Dori.\nOin and Gloin.\n\nHero models from this Army that are within 3\" of another Hero from the same Family Group may spend that model's Might, Will and Fate points as if they were their own."
      },
      {
        "title": "\"To the King!\"",
        "description": "If your Army contains only Hero models with the Infantry keyword at the beginning of the game, then friendly models may re-roll any To Wound Rolls of a natural 1 when making Strikes."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Expedition to the East": {
    "additional_rules": [
      {
        "description": "The General of an Expedition to the East Army must always be a Unique Hero."
      },
      {
        "description": "Dwarf Warrior models can only be included in the Warband of a Dwarf Hero."
      },
      {
        "description": "Gondor Warrior models can only be included in the Warband of a Gondor Hero."
      }
    ],
    "special_rules": [
      {
        "title": "Campaign in Rhûn",
        "description": "Friendly models gain the Hatred (Easterling) special rule."
      },
      {
        "title": "Unlikely Allies",
        "description": "Friendly Dwarf models may re-roll To Wound rolls of a natural 1 whilst within 1\" of a friendly Gondor model. Friendly Gondor models may re-roll To Wound rolls of a natural 1 whilst within 1\" of a friendly Dwarf model."
      },
      {
        "title": "Spoils of War",
        "description": "At the beginning of the game, before either Army has been deployed, your opponent secretly chooses a piece of terrain on the board; this contains the treasure your Army is seeking. If a friendly model ends its Activation in base contact with a piece of terrain and is not Engaged in Combat, it may search that piece of terrain. If it does, your opponent must reveal if that was their chosen terrain piece. If it was not, nothing happens. If it was, then the model discovers the treasure and leaves to return it to Minas Tirith. Remove the model from play – it does not count as a casualty. If when the game ends you have discovered the treasure, you gain an additional 2 Victory Points. This can never take this Army's controlling player's total Victory Points above 20."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Hatred (Easterling)"
    ],
    "legacy": true
  },
  "Fangorn": {
    "additional_rules": [
      {
        "description": "A Fangorn Army must always contain Treebeard, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "\"Don't be Hasty\"",
        "description": "Friendly Ent models are completely unaffected by any Magical Powers that would attempt to Move them, or prevent them from Activating or Moving."
      },
      {
        "title": "One with the Forest",
        "description": "Friendly Ent models are completely unaffected by the Call Winds, Nature's Wrath, Wrath of Bruinen and Writhing Vines Magical Powers."
      },
      {
        "title": "\"Beech. Oak. Chestnut. Ash. Many have come\"",
        "description": "Whenever you include an Ent Warrior in your Army, you may assign one of the four types of Ent to it, as listed below. You must split the types of Ent as evenly as possible. So, if you want to have a second of one type of Ent, you must first have one of each of the types. If you want to have a third of one type of Ent, you must first have two of each of the types, and so on.\n\nBeech - The Ent may re-roll To Wound rolls of a natural 1 when making Strikes.\n\nOak - The Ent improves its Wounds characteristic to 4.\n\nChestnut - The Ent gains the Mighty Blow special rule.\n\nAsh - The Ent improves their Shoot Value to 3+ and can still use its Throw Stones special rule even if it has Moved that turn (though not if it has Moved over half its Move Value)."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Mighty Blow"
    ]
  },
  "Far Harad": {
    "additional_rules": [
      {
        "description": "A Far Harad Army must always contain a Mahûd King, who is always the Army’s General."
      }
    ],
    "special_rules": [
      {
        "title": "Warrior Pride",
        "description": "Mahûd Warrior models within 6\" of a friendly Mahûd Hero model that is Engaged in Combat automatically pass all Courage Tests they are required to take."
      },
      {
        "title": "Revel in Death",
        "description": "If your General slays an enemy Hero model in Combat, then until the end of the turn friendly Mahûd Warrior models within 6\" of your General gain a bonus of +1 to their Fight Value."
      },
      {
        "title": "Battle Frenzy",
        "description": "Whenever a friendly Mahûd model suffers a Wound, roll a D6. On the roll of natural 6, the Wound is ignored."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [],
    "legacy": true
  },
  "Fell Beings of Mirkwood": {
    "additional_rules": [
      {
        "description": "A Fell Beings of Mirkwood Army must always contain Razgûsh, who is always the Army’s General."
      }
    ],
    "special_rules": [
      {
        "title": "Through the Forest",
        "description": "Friendly Infantry models gain the Woodland Creature special rule."
      },
      {
        "title": "Death to the Elves",
        "description": "Friendly models gain the Hatred (Elf) special rule."
      },
      {
        "title": "The War Leader",
        "description": "Whilst Engaged in Combat with an enemy Elf model, Razgûsh gains a bonus of +1 to his Fight Value."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Hatred (X)"
    ],
    "legacy": true
  },
  "Fields of Celebrant": {
    "additional_rules": [
      {
        "description": "A Fields of Celebrant Army must always contain Eorl the Young, who is always the Army's General."
      },
      {
        "description": "A Fields of Celebrant Army must always contain a King of Men, which must choose the Gondor keyword as part of its Kingdoms of Men special rule. No other Kings of Men can be taken."
      },
      {
        "description": "Rohan Warrior models can only be included in the Warband of a Rohan Hero."
      },
      {
        "description": "Gondor Warrior models can only be included in the Warband of a Gondor Hero."
      }
    ],
    "special_rules": [
      {
        "title": "Birth of an Alliance",
        "description": "Friendly models within 6\" of both a friendly Rohan Hero model and a friendly Gondor Hero model gain a bonus of +1 to any Courage or Intelligence Tests they are required to take."
      },
      {
        "title": "Gondor's Last Defence",
        "description": "Friendly Gondor models within range of an Objective Marker may re-roll To Wound rolls of a natural 1 when making Strikes."
      },
      {
        "title": "The Charge of Eorl",
        "description": "Once per game, at the start of any friendly Activation Phase, Eorl can use this special rule so long as he is alive and on the battlefield, and has the Cavalry keyword. If he does, then until the end of the turn all friendly Cavalry models must Charge when they Move if able. Additionally, until the end of the turn, friendly Cavalry models that Charged this turn may re-roll any failed To Wound rolls when making Strikes."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [],
    "legacy": true
  },
  "Fords of Isen": {
    "additional_rules": [
      {
        "description": "A Fords of Isen Army must always contain Théodred, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "Protect the Prince",
        "description": "Friendly models gain the Sworn Protector (Théodred) special rule."
      },
      {
        "title": "Resolute Rohirrim",
        "description": "If your Army is Broken, friendly models gain the Dominant (2) special rule."
      },
      {
        "title": "The Courage of Elfhelm",
        "description": "If Théodred is Engaged in Combat within 6\" of Elfhelm, then enemy models may not make Strikes against Théodred if there is another model they could make Strikes against instead."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Sworn Protector (Theodred)",
      "Dominant (2)"
    ]
  },
  "Garrison of Dale": {
    "additional_rules": [
      {
        "description": "A Garrison of Dale Army must include Girion, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "\"Girion, lord of the city, rallied his bowmen to fire upon the beast\"",
        "description": "Friendly Dale models improve their Shoot Value to 3+."
      },
      {
        "title": "Bring down the Dragon",
        "description": "Friendly Dale models may apply their Hatred (Dragon) special rule to their shooting attacks. Additionally, friendly Dale models may re-roll failed To Hit Rolls when making a shooting attack targeting a Monster model."
      },
      {
        "title": "Girion's Last Stand",
        "description": "Girion gains the Fearless special rule. Additionally, friendly Dale models that can draw Line of Sight to Girion gain a bonus of +1 to any Courage Tests they are required to take."
      },
      {
        "title": "Defenders of Dale",
        "description": "Friendly Dale models that are within their deployment zone, and/or within 6\" of a friendly Windlance, gain a bonus of +1 To Wound when making Strikes."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Fearless"
    ]
  },
  "Garrison of Ithilien": {
    "additional_rules": [
      {
        "description": "A Garrison of Ithilien Army must include Faramir, Captain of Gondor, who is always the Army's General."
      },
      {
        "description": "You may only include Sam if your Army also includes Frodo. You may only include Smeagol if your Army includes Frodo and Sam."
      },
      {
        "description": "Frodo, Sam and Smeagol may not lead Warrior models in this Army."
      }
    ],
    "special_rules": [
      {
        "title": "Captured by Gondor",
        "description": "Frodo, Sam and Smeagol may either be deployed as a single Warband with Frodo as the Warband's Captain, or as part of Faramir's Warband."
      },
      {
        "title": "Faramir's Rangers",
        "description": "A Garrison of Ithilien Army has a Bow Limit of 50% rather than the usual 33%."
      },
      {
        "title": "Experienced Trackers",
        "description": "At the start of each game, you may choose either Woodland Creature or Mountain Dwellers. Friendly Gondor models gain the chosen special rule for the duration of the game."
      },
      {
        "title": "\"I think at last we understand one another, Frodo Baggins\"",
        "description": "At the end of the game, you will score an additional Victory Point for each of Frodo, Sam and Smeagol that are still alive, or have escaped the battlefield in Scenarios where this applies. This can never take your total number of Victory Points for a Scenario above 20."
      }
    ],
    "bow_limit": 0.5,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Mountain Dweller",
      "Woodland Creature"
    ]
  },
  "Goblin-town": {
    "additional_rules": [
      {
        "description": "A Goblin-town Army must always contain the Goblin King, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "\"I Feel A Song Coming On\"",
        "description": "During the Priority Phase, after Priority has been determined, the Goblin King may choose to sing one of his songs. If he does, choose one of the songs below and apply its effects until the end of the turn. The Goblin King may not sing the same song as he sung the previous turn.\n\n\"Batter and beat, make them stammer and squeak!\" - Other friendly Goblin models treat the Goblin King as a banner with a range of 6.\n\n\"You can yammer and yelp but there ain't no help!\" - Other friendly Goblin models within 6\" of the Goblin King cause Terror.\n\n\"Abominations, mutations, deviations\" - Whenever another friendly Goblin model within 6\" of the Goblin king suffers a Wound, roll a D6. On the roll of a natural 6, the Wound is ignored.\n\n\"Bones will be shattered, necks will be wrung\" - Other friendly Goblin models within 6\" of the Goblin King may re-roll To Wound Rolls of a natural 1 when making Strikes."
      },
      {
        "title": "Strength In Numbers",
        "description": "Whilst your Army is not Broken, friendly Goblin models receive a bonus of +1 to any Courage Tests they take for Charging an enemy with the Terror special rule."
      },
      {
        "title": "\"If they won't talk, we'll make them squawk!\"",
        "description": "If the Goblin King or Grinnah would kill an enemy non-Monster Hero model in Combat, they can choose to take them prisoner instead. The Hero model will still be removed as a casualty, including for the purpose of any objectives or special rules. The Goblin King and Grinnah may only ever have a single prisoner each at any one time; if they would subsequently be able to take another prisoner whilst they already have one, they must choose which one counts as their prisoner. If the Goblin King or Grinnah are still alive at the end of the game, their controlling player will gain an additional 1 Victory Point for each enemy Hero that is a prisoner, so long as the model that took them prisoner is still alive. This can never take this Army's total number of Victory Points above 20."
      },
      {
        "title": "\"Down down down in Goblin-town\"",
        "description": "Each Goblin Hero model may increase their maximum Warband size by six models."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Terror"
    ]
  },
  "Grand Army of the South": {
    "additional_rules": [
      {
        "description": "Corsair Warrior models can only be included in the Warband of a Corsair Hero."
      },
      {
        "description": "Harad Warrior models can only be included in the Warband of a Harad Hero."
      },
      {
        "description": "Easterling Warrior models can only be included in the Warband of an Easterling Hero."
      }
    ],
    "special_rules": [
      {
        "title": "Pride of the Southlands",
        "description": "Friendly models gain a bonus of +1 to any Courage Tests they are required to take."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Halls of Thranduil": {
    "additional_rules": [],
    "special_rules": [
      {
        "title": "\"The Elves of Mirkwood are not like their kin. They are less wise, and more dangerous\"",
        "description": "Friendly Mirkwood Warrior models within 3\" of Thranduil gain a bonus of +1 to Wound when making Strikes."
      },
      {
        "title": "Stoic Command",
        "description": "Friendly Warrior models treat your General as a banner."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Harad": {
    "additional_rules": [
      {
        "description": "A Harad Army may have up to 50% of its Warrior models armed with bows rather than the usual 33%."
      }
    ],
    "special_rules": [
      {
        "title": "War Beasts from the South",
        "description": "Friendly Mûmak models gain the Harbinger of Evil (12\") special rule."
      },
      {
        "title": "The Scorpion's Sting",
        "description": "Friendly models with the Poisoned Attacks (bow) special rule exchange it for Poisoned Attacks on all of their weapons."
      },
      {
        "title": "Monstrous Rampage",
        "description": "Each Hero that is commanding a Mûmak can, once per game, declare a Heroic Combat for free whilst atop a Mûmak. When they do, the Mûmak will be affected as if they had been the one to declare the Heroic Combat, though they may not pivot before they Trample as part of a Heroic Combat."
      }
    ],
    "bow_limit": 0.5,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Host of the Dragon Emperor": {
    "additional_rules": [
      {
        "description": "A Host of the Dragon Emperor Army must always contain the Dragon Emperor of Rhûn, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "Heroes of the Easterlings",
        "description": "Friendly Easterling Hero models may re-roll a single D6 in a Duel Roll."
      },
      {
        "title": "Easterling Phalanxes",
        "description": "Friendly models Supported by two other friendly models gain a bonus of +1 To Wound when making Strikes."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Host of the Witch-king": {
    "additional_rules": [
      {
        "description": "A Host of the Witch-king Army must always contain the Witch-king of Angmar, who is always the Army's General."
      },
      {
        "description": "No more than 50% of your models may have the Carn Dûm keyword."
      }
    ],
    "special_rules": [
      {
        "title": "\"If that fell Kingdom should rise again, Rivendell, Lórien, the Shire, even Gondor itself shall fall.\"",
        "description": "Friendly Angmar Orc models within 3\" of a friendly Spirit Hero model gain the Terror special rule."
      },
      {
        "title": "Lord of the Nazgul",
        "description": "The Witch-king only loses a Will Point for having been in a Combat if he loses a Combat during the Fight phase (for example, if he doesn’t win the Duel Roll to see which side may make Strikes)."
      },
      {
        "title": "\"No Man can kill me!\"",
        "description": "Whilst Engaged in Combat with an enemy Man model, the Witch-king gains a bonus of +1 to his Fight Value."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Terror"
    ]
  },
  "Kingdom of Khazad-Dum": {
    "additional_rules": [
      {
        "description": "If a Dwarf King is your General, they gain the Leader (Khazâd Guard) special rule."
      }
    ],
    "special_rules": [
      {
        "title": "\"The wealth of Moria lay not in gold or jewels, but in Mithril\"",
        "description": "Friendly models may re-roll To Wound Rolls of a natural 1 when making Strikes."
      },
      {
        "title": "Steadfast Warriors",
        "description": "Friendly Dwarf Captains, Dwarf Warriors and Dwarf Rangers gain the Dominant (2) special rule."
      },
      {
        "title": "The Stubbornness of Dwarves",
        "description": "During a Duel Roll, before any re-rolls have been used, if the opposition player has rolled more dice (including for Supporting models), then a single friendly Khazad-dûm model may re-roll a single D6 as part of the Duel Roll."
      },
      {
        "title": "Dwarven Mirrors",
        "description": "At the start of the game, after both sides have deployed, you may deploy two 40mm Dwarven Mirror Markers anywhere on the battlefield that is not within the opposition deployment zone. The area within 6\" of a Dwarven Mirror Marker is always considered to be daylight. Enemy models targeting a friendly model within 6\" of a Dwarven Mirror Marker with a shooting attack suffers a -1 penalty to the To Hit Roll. Additionally, Orc models, Goblin models, or models with the Cave Dweller special rule, suffer a -1 penalty to any Courage Tests they are required to take whilst they are within 6\" of a Dwarven Mirror Marker. If, during the End Phase of a turn, an enemy model is in base contact with a Dwarven Mirror Marker, that model hasn't done anything during that turn except Move (i.e., has not made a shooting attack, cast a Magical Power, been Engaged in Combat), and that model was not affected by a Magical Power that turn, then it can remove the Dwarven Mirror Marker from play. Models cannot overlap a Dwarven Mirror Marker for any reason, though a War Beast or Chariot that Moves into base contact with one (via Trample or Chariot Charge respectively) will immediately remove it from play and may carry on as normal."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Leader (Khazad Guard)",
      "Dominant (2)",
      "Burly"
    ]
  },
  "Kingdom of Rohan": {
    "additional_rules": [
      {
        "description": "Riders of Rohan do not count towards this Army's Bow Limit."
      }
    ],
    "special_rules": [
      {
        "title": "\"Ride for ruin and the world's ending\"",
        "description": "Friendly <b>Rohan Cavalry</b> models gain a bonus of +1 to their Strength on a turn in which they Charge."
      },
      {
        "title": "Home of the Horse Lords",
        "description": "When rolling for their Horse Lord special rule, friendly models will pass the roll on a natural 5+ rather than a natural 6."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Legions of Mordor": {
    "additional_rules": [
      {
        "description": "Mordor Warrior models can only be included in the Warband of a Mordor Hero."
      },
      {
        "description": "Harad Warrior models can only be included in the Warband of a Harad Hero."
      },
      {
        "description": "Easterling Warrior models can only be included in the Warband of an Easterling Hero."
      }
    ],
    "special_rules": [
      {
        "title": "Bring the City to its Knees",
        "description": "Friendly Hero models may re-roll To Wound Rolls of a natural 1 when making Strikes against an enemy Hero model."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Lindon": {
    "additional_rules": [
      {
        "description": "A Lindon Army must include Gil-galad, High King of the Noldor, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "\"Tangado haid, leithio i philinn!\"",
        "description": "Whilst within 3\" of a friendly Hero friendly Warrior models may re-roll failed To Hit rolls when making a shooting attack, providing they didn't Move in the preceding Move Phase."
      },
      {
        "title": "The Power of the Noldor",
        "description": "Friendly models within 6\" of Gil-galad gain the Resistant to Magic special rule."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Resistant to Magic"
    ]
  },
  "Lothlorien": {
    "additional_rules": [],
    "special_rules": [
      {
        "title": "\"They say a great sorceress lives in these woods...\"",
        "description": "Friendly Lothlorien models gain the Resistant to Magic special rule."
      },
      {
        "title": "\"The Dwarf breathes so loud, we could have shot him in the dark\"",
        "description": "Friendly Lothlorien models may re-roll To Hit rolls of a 1 when making a shooting attack if the target of the shooting attack is unable to see them due to the effects of an Elven cloak."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Resistant to Magic"
    ]
  },
  "Lurtz's Scouts": {
    "additional_rules": [
      {
        "description": "A Lurtz's Scouts Army must always contain Lurtz, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "Relentless March",
        "description": "Friendly models increase their Move Value to 8\". Additionally, friendly models gain the Woodland Creature special rule."
      },
      {
        "title": "\"You do not know pain, you do not know fear\"",
        "description": "The Break Point for Lurtz's Scouts is 66% rather than 50%."
      },
      {
        "title": "\"Kill the others\"",
        "description": "Lurtz gains the General Hunter special rule and may declare a Heroic Combat each turn for free."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "break_point": 0.66,
    "rule_highlights": [
      "General Hunter",
      "Woodland Creature"
    ]
  },
  "Men of the West": {
    "additional_rules": [
      {
        "description": "A Men of the West Army must include Aragorn, King Elessar, who is always the Army's General."
      },
      {
        "description": "If your Army includes any Cavalry models then it cannot include any Eagle models, and vice versa."
      },
      {
        "description": "Only Gwaihir can include Great Eagles in his Warband, and Gwaihir can only include Great Eagles in his Warband."
      },
      {
        "description": "Gandalf the White does not have his Staff of Power in this Army."
      }
    ],
    "special_rules": [
      {
        "title": "\"For Frodo!\"",
        "description": "Once per game, at the start of any Fight Phase, Aragorn can use this special rule so long as he is alive and on the battlefield. If he does, then friendly non-Eagle models within 6\" of Aragorn gain a bonus of +1 Fight Value and may re-roll To Wound rolls of a natural 1 when making Strikes until the end of the turn. This is treated as an Active ability belonging to Aragorn."
      },
      {
        "title": "\"This day we fight!\"",
        "description": "So long as Aragorn is alive and on the battlefield, friendly models automatically pass any Courage Tests they are required to take."
      },
      {
        "title": "The Final Stand",
        "description": "Friendly Infantry models within 3\" of a friendly Hero model gain the Dominant (2) special rule."
      },
      {
        "title": "The White Wizard",
        "description": "Gandalf may re-roll a single D6 in any Casting Rolls he makes."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Minas Morgul": {
    "additional_rules": [
      {
        "description": "A Minas Morgul Army must always contain the Witch-king of Angmar, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "The Dead City",
        "description": "Mordor Orc Captains and Mordor Orc Warriors gain the Blades of the Dead special rule."
      },
      {
        "title": "Call of Morgul",
        "description": "If the enemy Army contains a Ringbearer they will suffer a penalty when rolling for Sauron's Will."
      },
      {
        "title": "Lead through fear",
        "description": "Friendly Orc models within 3\" of a friendly Spirit model automatically pass Courage Tests when attempting to Charge a model with the Terror special rule."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Blades of the Dead"
    ]
  },
  "Minas Tirith": {
    "additional_rules": [
      {
        "description": "If your Army includes Denethor, then he must be your General."
      }
    ],
    "special_rules": [
      {
        "title": "\"Do you think the eyes of the white tower are blind?\"",
        "description": "Once per game, during the Priority Phase but before the roll for Priority, Denethor can use this special rule so long as he is alive and on the battlefield. If he does, Denethor's controlling player automatically wins the roll to choose who has Priority for that turn. If both sides have a special rule allowing them to do this and both wish to use it in the same turn, players roll off as normal and both special rules count as being used."
      },
      {
        "title": "\"Is there a captain here who still has the courage to do his lord's will?\"",
        "description": "If your Army includes both Faramir and Denethor, then whilst Denethor is alive and on the battlefield, Faramir will automatically pass all Courage Tests he is required to make. Additionally, whilst Denethor is alive and on the battlefield, when Faramir Moves he must Charge if able to do so."
      },
      {
        "title": "Faramir's Charge",
        "description": "Whilst he has the Cavalry keyword, before Faramir Charges make a note of where he begins his Activation. Until the end of the turn, friendly Gondor Cavalry Warrior models within 6\" of where Faramir begins his Activation gain the Fearless special rule and, if they Charge, gain a bonus of +1 to their Fight Value."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Fearless"
    ]
  },
  "Moria": {
    "additional_rules": [
      {
        "description": "Beast Warrior models may only be included in Drûzhag's Warband."
      }
    ],
    "special_rules": [
      {
        "title": "\"We cannot get out, they are coming.\"",
        "description": "Friendly Moria Goblin models Engaged in Combat with an enemy model that would be considered Trapped gain a bonus of +1 to their Fight Value for the duration of the Combat."
      },
      {
        "title": "Skittering Warriors",
        "description": "Friendly Moria Goblin models gain the Mountain Dweller special rule."
      },
      {
        "title": "Durbûrz's Will",
        "description": "Once per game, at the start of his Activation, Durbúrz may declare he is using this ability. If he does, Durbûrz may not Move during his Activation; however, all friendly Moria Goblin models gain a bonus of +2\" to their Move Value until the End Phase of the turn. Additionally, in a turn in which Durbûrz uses this ability, all friendly Moria Goblin models within 6\" of him automatically pass any Courage Tests required when attempting to Charge a model with the Terror special rule."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Mountain Dweller"
    ]
  },
  "Muster of Isengard": {
    "additional_rules": [
      {
        "description": "A Muster of Isengard Army must always contain Saruman, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "\"You do not know pain, you do not know fear\"",
        "description": "The Break Point for a Muster of Isengard Army is 66% rather than 50%."
      },
      {
        "title": "Isengard Unleashed",
        "description": "During the first turn of the game, each friendly Uruk-hai Hero may declare a Heroic March for free. Additionally, Uruk-hai Captains gain Heroic Strike."
      },
      {
        "title": "\"There will be no dawn for Men\"",
        "description": "Friendly Uruk-hai models gain the Hatred (Man) special rule."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "break_point": 0.66,
    "rule_highlights": []
  },
  "Numenor": {
    "additional_rules": [],
    "special_rules": [
      {
        "title": "Blood of Numenor",
        "description": "Friendly Numenor models gain the Resistant to Magic special rule whilst they are within 6\" of a friendly Unique Numenor Hero model."
      },
      {
        "title": "The Resolve of Men",
        "description": "Friendly Numenor models gain a bonus of +1 to any Courage tests they have to take."
      },
      {
        "title": "The Line of Kings",
        "description": "If they have the Unique keyword, your General gains the General Hunter special rule. Additionally, your General must always accept a Heroic Challenge directed at them."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "General Hunter",
      "Resistant to Magic"
    ]
  },
  "Paths of the Druadan": {
    "additional_rules": [
      {
        "description": "A Paths of the Druadan Army must always contain Theoden, who is always the Army's General."
      },
      {
        "description": "A Paths of the Druadan Army must always contain Ghan-buri-Ghan and a Warband of at least 12 Woses Warriors."
      },
      {
        "description": "Riders of Rohan do not count towards this Army's bow limit."
      }
    ],
    "special_rules": [
      {
        "title": "Know All Paths",
        "description": "If during the Declare Heroic Actions step of a Move Phase, both sides have declared a Heroic Move and a roll-off is required to see which side's Heroic Move happens first, this Army will gain a bonus to that roll. If they would normally win the roll-off on a 4+, they will instead win it on a 3+. If they would normally win the roll-off on a 1, 2, or 3, they will instead win the roll-off on a 1, 2, 3, or 4."
      },
      {
        "title": "Kill Orc-folk",
        "description": "Friendly models may re-roll To Wound Rolls of a natural 1 when making Strikes against Orc, Goblin, or Uruk-hai models."
      },
      {
        "title": "Waypoints",
        "description": "At the start of the game, after both sides have been deployed, you may place up to three 25mm Waypoint Markers anywhere on the battlefield. Whilst within 6\" of a friendly Waypoint Marker, friendly Rohan models don't suffer penalties for Moving, or Charging, through Difficult Terrain."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Pits of Dol Guldur": {
    "additional_rules": [
      {
        "description": "A Pits of Dol Guldur Army must always contain Azog, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "Surprise Attack",
        "description": "Once per game, at the beginning of the Priority Phase, Azog can use this special rule if he is alive and on the battlefield. If he does, Azog's controlling player will automatically count as having won the roll to choose who has Priority for that turn, though must choose to have Priority. If both sides have a special rule allowing them to do this and both wish to use it in the same turn, players roll off as normal and both special rules count as being used. Enemy models cannot declare Heroic Moves in the turn in which this special rule is used."
      },
      {
        "title": "Magical Void",
        "description": "Friendly models gain the Resistant to Magic special rule."
      },
      {
        "title": "Thrain's Imprisonment",
        "description": "Thrain the Broken is an Evil model in this Army. Additionally, if Thrain fails his Intelligence Test for his Shattered Spirit special rule whilst within 6\" of the Keeper of the Dungeons, then he will count as passing the test instead, though will not count as rolling a double."
      },
      {
        "title": "Wizard Hunters",
        "description": "Friendly Orc Warrior models gain a bonus of +1 To Wound when making Strikes against enemy models that can Cast Magical Powers."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Resistant to Magic"
    ]
  },
  "Radagast's Alliance": {
    "additional_rules": [
      {
        "description": "A Radagast's Alliance Army must include Radagast, who is always the Army's General."
      },
      {
        "description": "Radagast's Alliance may not include more Fledgeling Great Eagles than Great Eagles."
      }
    ],
    "special_rules": [
      {
        "title": "\"The Eagles are Coming!\"",
        "description": "Friendly Eagle models gain a bonus of +1 to their Strength on a turn in which they Charge."
      },
      {
        "title": "Beorn's Fury",
        "description": "If Beorn is involved in a Combat and kills every model he was Engaged in Combat with, then in the following turn he may declare a Heroic Move for free."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Rangers of Mirkwood": {
    "additional_rules": [
      {
        "description": "A Rangers of Mirkwood must include at least one Unique Elf Hero."
      },
      {
        "description": "If your Army includes Legolas, then he must be your General. If your Army includes Tauriel, but does not include Legolas, then she must be your General."
      },
      {
        "description": "Mirkwood Rangers may only be included in the Warbands of Mirkwood Hero models."
      },
      {
        "description": "Mirkwood Rangers do not count towards this Army's Bow Limit."
      }
    ],
    "special_rules": [
      {
        "title": "Knife Mastery",
        "description": "Friendly Elf models may re-roll To Wound Rolls of a natural 1 when making Strikes. Additionally, friendly Elf models may use the Shielding special rule, however, they cannot use their Knife Fighters or Blade Mistress special rules in a turn in which they elect to Shield."
      },
      {
        "title": "The Prince of Mirkwood",
        "description": "Legolas gains the Knife Fighters special rule - If Outnumbered in Combat, then before making his Duel roll, Legolas gains +1 Attack for each model he is Engaged in Combat with, after the first, up to the a maximum of 3 bonus Attacks. This bonus lasts until the end of the Combat."
      },
      {
        "title": "Dwarven Resilience",
        "description": "Friendly Dwarf models may re-roll failed Fate Rolls."
      },
      {
        "title": "Clear the Nests",
        "description": "Friendly models gain the Hatred (Spider) special rule."
      },
      {
        "title": "\"If you think I'm giving you a weapon Dwarf, you are sorely mistaken\"",
        "description": "Friendly Dwarf models cannot benefit from the Heroic Actions or Stand Fast of friendly Elf models and friendly Elf models cannot benefit from the Heroic Actions or Stand Fast of friendly Dwarf models. Additionally, Tauriel's Vengeful Fury special rule does not apply in this Army List."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Ravagers of the Shire": {
    "additional_rules": [
      {
        "description": "A Ravagers of the Shire Army must always contain Golfimbul, who is always the Army’s General."
      }
    ],
    "special_rules": [
      {
        "title": "Golfimbul’s Rage",
        "description": "Golfimbul may declare a Heroic Combat each turn for free."
      },
      {
        "title": "Courage from Ignorance",
        "description": "Whilst Golfimbul is still alive and on the battlefield, friendly Orc models gain a bonus of +1 to any Courage Tests they are required to take."
      },
      {
        "title": "Overwhelm the Foe",
        "description": "Friendly Orc models gain a bonus of +1 To Wound when making Strikes against an enemy model that is outnumbered in a Combat."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [],
    "legacy": true
  },
  "Realms of Men": {
    "additional_rules": [
      {
        "description": "Kings of Men are always a Hero of Legend. A King of Men may include Warrior models in their Warband from any Army List, so long as they share the same Faction Keyword."
      },
      {
        "description": "A Realms of Men Army can never include any models with the Unique Keyword under any circumstances. However, it can include Hero models without the Unique Keyword so long as they share a Faction Keyword with a King of Men already in the Army. For example, a Realms of Men Army with a King of Men with the Gondor Keyword could include a Captain of Minas Tirith as they would both have the Gondor Keyword. Hero models included in this manner may also include Warrior models in their Warband with the same Faction Keyword."
      },
      {
        "description": "When working out which King of Men is your Army's General, it must be the one which shares the most common Faction Keyword throughout your Army. For example, if the most common Faction Keyword in your Army is Rohan, then the King of Men with the Rohan Keyword must be your General."
      },
      {
        "description": "A Realms of Men Army may not have two Kings of Men with the same Faction Keyword; however, they may have multiple Kings of Men with different Faction Keywords."
      },
      {
        "description": "The Realms of Men Army List allows you to create your own forces and combine multiple factions of Men in a way that suits you."
      }
    ],
    "special_rules": [],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Reclamation of Moria": {
    "additional_rules": [
      {
        "description": "A Reclamation of Moria Army must always contain Balin, who is always the Army's General."
      },
      {
        "description": "Ori and Óin gain the Khazad-dûm keyword."
      }
    ],
    "special_rules": [
      {
        "title": "Reclaim Moria",
        "description": "At the end of the game, if you control more Objective Markers than your opponent (if applicable), or are in possession of more Objective Markers than your opponent (if applicable), you score an additional 2 Victory Points. This can never take this Army's controlling player's total Victory Points above 20. Models that escape the board carrying an Objective Marker count as still being in possession of that Objective Marker for the purpose of this special rule."
      },
      {
        "title": "A Desperate Defence",
        "description": "Whilst this Army is considered to be Broken, friendly models gain a bonus of +1 To Wound when making Strikes."
      },
      {
        "title": "Balin's Last Stand",
        "description": "At the beginning of the Fight Phase, at the start of the Declare Heroic Actions Step, any friendly Dwarf Hero models that would be considered Trapped may declare a Heroic Defence for free, even if they could not normally declare a Heroic Defence."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [],
    "legacy": true
  },
  "Reclamation of Osgiliath": {
    "additional_rules": [
      {
        "description": "A Reclamation of Osgiliath Army must include Boromir, Captain of the White Tower, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "\"Remember today, little brother\"",
        "description": "While Boromir and Faramir are within 3\" of each other, they may spend each other's Might, Will and Fate points as if they were their own."
      },
      {
        "title": "\"This city was once the jewel of our kingdom\"",
        "description": "Friendly models gain the Mountain Dweller special rule."
      },
      {
        "title": "\"For Gondor!\"",
        "description": "Once per game, at the start of any Fight Phase, Boromir can use this special rule so long as he is alive and on the battlefield. If he does, then friendly Gondor Warrior models within 6\" of Boromir gain a bonus of +1 To Wound when making Strikes until the end of the turn. This is treated as an Active ability belonging to Boromir."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Mountain Dweller"
    ]
  },
  "Return of the King": {
    "additional_rules": [
      {
        "description": "A Return of the King Army must include Aragorn (Strider) and the King of the Dead. Aragorn is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "The Heir of Isildur",
        "description": "Aragorn does not have to pay any points for Andúril, Flame of the West; he automatically has this upgrade"
      },
      {
        "title": "\"Fight for us and regain your honour\"",
        "description": "Friendly Dunharrow Warrior models within 3\" of Aragorn gain a bonus of +1 to their Fight Value."
      },
      {
        "title": "Visions of Terror",
        "description": "Whenever the King of the Dead Charges into Combat, after the Charge has been completed, he may spend a Will Point to use this special rule. If he does, enemy models within 3\" of the King of the Dead must take a Courage Test in an order chosen by the King of the Dead's controlling player. If the test is failed, the model must Move up to its Move Value directly away from the King of the Dead."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Ride Out": {
    "additional_rules": [
      {
        "description": "A Ride Out Army must always contain Theoden, who is always the Army's General."
      },
      {
        "description": "Riders of Rohan do not count towards this Army's Bow Limit."
      }
    ],
    "special_rules": [
      {
        "title": "\"Now for wrath, now for ruin and the red dawn\"",
        "description": "When a friendly Cavalry model Moves, it must Charge if able. Additionally, on a turn in which a friendly Cavalry model Charges, they gain a bonus of +1 to their Strength and may re-roll any 1s during a Duel Roll that turn."
      },
      {
        "title": "\"The horn of Helm Hammerhand shall sound in the deep; one last time\"",
        "description": "Once per game, at the start of any Move phase, you can declare you are using this special rule. Until the end of the turn, friendly Cavalry models gain the Terror special rule."
      },
      {
        "title": "\"For Death and Glory\"",
        "description": "Friendly models gain the Fearless special rule."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Fearless",
      "Terror"
    ]
  },
  "Riders of Eomer": {
    "additional_rules": [
      {
        "description": "A Riders of Eomer Army must include Eomer, who is always the Army's General."
      },
      {
        "description": "Riders of Rohan do not count towards this Army's Bow Limit."
      }
    ],
    "special_rules": [
      {
        "title": "Look to the sun",
        "description": "Once per game, at the start of any friendly Activation Phase, Gandalf can use this special rule so long as he is alive and on the battlefield. If he does, then until the end of the turn, enemy models Engaged in Combat with a friendly Cavalry model that made a Charge that turn, or Supporting a Combat against a friendly Cavalry model that made a Charge that turn, suffer a -1 penalty to their Duel Roll."
      },
      {
        "title": "\"Ride for ruin and the world's ending\"",
        "description": "Friendly Rohan Cavalry models gain a bonus of +1 to their Strength on a turn in which they Charge."
      },
      {
        "title": "\"To the King!\"",
        "description": "Eomer may declare a Heroic Combat each turn for free."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Riders of Theoden": {
    "additional_rules": [
      {
        "description": "A Riders of Theoden Army must always contain Theoden, who is always the Army's General."
      },
      {
        "description": "Riders of Rohan do not count towards this Army's Bow Limit."
      }
    ],
    "special_rules": [
      {
        "title": "\"Ride for ruin and the world's ending\"",
        "description": "Friendly Rohan Cavalry models gain a bonus of +1 to their Strength on a turn in which they Charge."
      },
      {
        "title": "\"Death!\"",
        "description": "Once per game, at the start of any Fight Phase, Theoden can use this special rule so long as he is alive and on the battlefield. If he does, then each friendly Rohan Hero within 12\" of Theoden can declare a free Heroic Combat or a free Heroic Strike (if able) during the declare Heroic Actions Step. This is treated as an Active ability belonging to Theoden."
      },
      {
        "title": "\"Forth Eorlingas!\"",
        "description": "Friendly Cavalry Warrior models within 3\" of either Theoden or Eomer gain the Dominant (2) special rule."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Rise of the Necromancer": {
    "additional_rules": [
      {
        "description": "When writing a Rise of the Necromancer Army List that contains only Hero models (with the exception of Hunter Orc Captains), a player can either have all models in a single Warband or as multiple smaller warbands as normal."
      }
    ],
    "special_rules": [
      {
        "title": "Power of the Necromancer",
        "description": "Friendly models gain the Resistant to Magic special rule. Additionally, the Necromancer can attempt to Cast two Magical Powers when he Activates rather than one; however, he may not attempt to Cast the same Magical Power twice, or target the same enemy model twice."
      },
      {
        "title": "\"His spirit has lost none of its potency\"",
        "description": "Each time the Necromancer attempts to Cast a Magical Power by expending one or more Will Points, he automatically adds an additional free Will Point to the Casting Test."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Resistant to Magic"
    ]
  },
  "Rivendell": {
    "additional_rules": [
      {
        "description": "If your Army includes Elrond, then Rivendell Knights do not count towards this Army's Bow Limit."
      }
    ],
    "special_rules": [
      {
        "title": "Protection of Imladris",
        "description": "Friendly models gain a bonus of +1 to any Courage Tests they are required to take."
      },
      {
        "title": "Defensive Stance",
        "description": "Friendly Elf Warrior models may re-roll To Wound rolls of a natural 1 when making Strikes so long as they have not Moved during the preceding Move Phase."
      },
      {
        "title": "Invoke the Bruinen",
        "description": "Once per game, so long as either Elrond or Arwen are alive and on the battlefield, you may use this special rule at the start of any Move Phase in which your Army is Broken. Place a 25mm Marker anywhere within 12\" and Line of Sight of Elrond or Arwen, and then roll a D6 for each enemy model within 3\" of that Marker. If the roll is equal to or over the Strength of the model, or is a natural 6, then the model immediately suffers a Strength 4 hit and, if it survives, will be knocked Prone. Remove the Marker after every affected enemy model has been rolled for."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Road to Helm's Deep": {
    "additional_rules": [
      {
        "description": "A Road to Helm's Deep Army must always contain Théoden, who is always the Army's General."
      },
      {
        "description": "Riders of Rohan do not count towards this Army's Bow Limit."
      }
    ],
    "special_rules": [
      {
        "title": "\"Ride for ruin and the world's ending\"",
        "description": "Friendly Rohan Cavalry models gain a bonus of +1 to their Strength on a turn in which they Charge."
      },
      {
        "title": "Legolas & Gimli",
        "description": "If your Army contains both Legolas and Gimli then Gimli will start the game as a Passenger on Legolas' horse and will use the rule for Passengers. Whilst Gimli is mounted on Legolas' horse, Legolas increases his Attacks to 3 and may use Gimli's Might, Will and Fate as if it was his own, though he cannot use Gimli's Might to improve To Hit, To Wound, or In The Way Tests when making a shooting attack. Additionally, if Gimli dismounts from Legolas' horse during Legolas' Move, then after Legolas' Activation has finished, Gimli may Activate as normal even though the rules for Passengers would not normally allow him to."
      },
      {
        "title": "Back on your horses",
        "description": "At the end of a friendly Infantry Hero model's Move (with the exception of Gimli), if they are in base contact with a friendly Cavalry Warrior model who is not Engaged in Combat, then the Warrior may give the Hero their horse. Replace the Warrior model with a suitable dismount, and replace the Hero with the mounted version of them. The Warrior will be placed in the same place the Hero was, and vice versa. If the Hero would normally have a named horse (such as Snowmane or Brego) then they will only count as riding a standard horse after using this rule."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Road to Rivendell": {
    "additional_rules": [
      {
        "description": "A Road to Rivendell Army must include Frodo."
      },
      {
        "description": "When writing a Road to Rivendell Army List, a player can either have all models in a single Warband or as multiple smaller warbands as normal."
      }
    ],
    "special_rules": [
      {
        "title": "\"We do not stop 'til nightfall\"",
        "description": "Aragorn may declare a Heroic March each turn for free. Additionally, friendly models that begin their Activation within 6\" of Aragorn gain the Woodland Creature special rule until the end of the turn."
      },
      {
        "title": "\"I'm the faster rider. I'll take him\"",
        "description": "If your Army includes both Frodo and Arwen, then Frodo may begin the game as a Passenger upon Asfaloth. Whilst Frodo is mounted on Asfaloth, Arwen gains the Resistant to Magic special rule, increases her Attacks characteristic to 3, and can spend Frodo's Might, Will and Fate Points as if they were her own. Frodo cannot put on the One Ring whilst he is a Passenger."
      },
      {
        "title": "\"If you want him, come and claim him\"",
        "description": "Whilst she is within 6\" of Frodo (including if he is a Passenger on Asfaloth), Arwen gains the Fearless special rule and may re-roll any dice when making a Casting Roll."
      },
      {
        "title": "The Cover of Night",
        "description": "At the start of each game using this Army List, you may choose for the Scenario to take place at night if you wish. If you do, then at the start of each Move Phase you may choose whether or not the Gatekeeper of Bree's A Light in the Dark special rule is in effect or not."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Fearless",
      "Resistant to Magic",
      "Woodland Creature"
    ]
  },
  "Shadows of Angmar": {
    "additional_rules": [],
    "special_rules": [
      {
        "title": "\"If that fell Kingdom should rise again, Rivendell, Lórien, the Shire, even Gondor itself shall fall.\"",
        "description": "Friendly Angmar Orc models within 3\" of a friendly Spirit Hero model gain the Terror special rule."
      },
      {
        "title": "Sense of Hopelessness",
        "description": "If an enemy Hero model is slain in Combat, then for the duration of the following turn, all enemy models suffer a -1 penalty to any Courage Tests they are required to take."
      },
      {
        "title": "The Shadows of Angmar",
        "description": "Friendly Spirit models gain the Stalk Unseen special rule."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Stalk Unseen",
      "Terror"
    ]
  },
  "Sharkey's Rogues": {
    "additional_rules": [
      {
        "description": "A Sharkey's Rogues Army must always contain Sharkey, who is always the Army's General."
      },
      {
        "description": "Hobbit Warrior models can only be included in the Warband of a Hobbit Hero."
      },
      {
        "description": "This Army may include Warbands of 10-12 Ruffians without a Hero to lead them. In these Warbands, nominate a single Warrior model to count as the Warband's Captain for the purpose of deployment. These Warbands may only be included after all other available Hero models have been included in the Army."
      }
    ],
    "special_rules": [
      {
        "title": "\"You do what Sharkey says!\"",
        "description": "Sharkey's Stand Fast will cover the entire battlefield, regardless of range"
      },
      {
        "title": "Strength in Numbers",
        "description": "Whilst this Army is not Broken, friendly Ruffian models gain a +1 bonus to any Courage Tests they are required to take."
      },
      {
        "title": "The Wizard's Command",
        "description": "Friendly Ruffian models within 6\" of Sharkey may use his Courage instead of their own when taking Courage Tests."
      },
      {
        "title": "Sharkey's Wrath",
        "description": "Sharkey gains the Hatred (Hobbit) special rule."
      },
      {
        "title": "The Chief's Whips",
        "description": "Friendly Ruffian models gain a bonus of +1 To Hit when making a shooting attack with a whip."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Hatred (Hobbit)"
    ]
  },
  "Survivors of Lake-town": {
    "additional_rules": [
      {
        "description": "A Survivors of Lake-town Army must include Bard the Bowman, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "Saviour of Lake-town",
        "description": "Other friendly Lake-town models within 6\" of Bard gain a bonus of +1 to their Fight Value. Additionally, other friendly Lake-town models treat Bard as a banner with a range of 6\". Alfrid does not benefit from this special rule."
      },
      {
        "title": "Heir of Dale",
        "description": "Bard the Bowman gains the Mighty Hero and Fearless special rules."
      },
      {
        "title": "Hold the Streets",
        "description": "Friendly Warrior models within range of an Objective Marker may re-roll To Wound Rolls of a natural 1 when making Strikes."
      },
      {
        "title": "Master Burglar",
        "description": "Whilst Bilbo is wearing the One Ring and is Invisible, if he Moves through an enemy model that is holding an Objective Marker in Scenarios where this is relevant, Bilbo may roll a D6; on a 2+, Bilbo immediately gains control of the Objective Marker. Bilbo cannot use this ability if he cannot carry the Objective Marker in question for whatever reason."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Fearless",
      "Mighty Hero"
    ]
  },
  "The Battle of Five Armies": {
    "additional_rules": [
      {
        "description": "Elf Warrior models can only be included in the Warband of an Elf Hero."
      },
      {
        "description": "Dwarf Warrior models can only be included in the Warband of a Dwarf Hero."
      },
      {
        "description": "Lake-town Warrior models can only be included in the Warband of a Lake-town Hero, or in the Warband of Gandalf the Grey or Bilbo Baggins."
      },
      {
        "description": "Eagle Warrior models can only be included in the Warband of an Eagle Hero, or in the Warband of Radagast the Brown or Beorn."
      },
      {
        "description": "The Battle of Five Armies may not include more Fledgeling Great Eagles than Great Eagles."
      }
    ],
    "special_rules": [
      {
        "title": "We stand together",
        "description": "Friendly models may re-roll To Wound Rolls of a natural 1 when making Strikes if they are involved in a Combat with a friendly model that has a different racial Keyword to themselves."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "The Beornings": {
    "additional_rules": [],
    "special_rules": [
      {
        "title": "Great Resilience",
        "description": "Whenever a friendly Bear model suffers a Wound, roll a D6.On the roll of a natural 6, the Wound is ignored."
      },
      {
        "title": "Natural Resistance",
        "description": "Friendly models gain the Resistant to Magic special rule."
      },
      {
        "title": "Ursine Fury",
        "description": "At the beginning of each Move Phase, before the Declare Heroic Action step, you may roll a D6 for each friendly Bear model you have on the battlefield. If any of the D6 roll a natural 6, then for the duration of the turn enemy models suffer a -1 penalty to any Courage Tests they are required to take as a result of trying to Charge a model with the Terror special rule."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Terror",
      "Resistant to Magic"
    ]
  },
  "The Black Gate": {
    "additional_rules": [
      {
        "description": "A Black Gate Army must always contain a Mordor Troll Chieftain, who is always the Army's General, and the Mouth of Sauron. The Mordor Troll Chieftain that is your General is treated as a Hero of Valour."
      }
    ],
    "special_rules": [
      {
        "title": "Greatest of the Trolls",
        "description": "The Mordor Troll Chieftain that is your General gains the Fearless special rule, and an additional point each of Might, Will and Fate."
      },
      {
        "title": "The Hordes of Mordor",
        "description": "Friendly Mordor Orc models Engaged in Combat gain a bonus of +1 To Wound when making Strikes against an outnumbered opponent."
      },
      {
        "title": "Temptation of Sauron",
        "description": "At the start of each Move Phase before the Declare Heroic Actions Step, you may choose a single enemy model on the battlefield. The chosen model must immediately take an Intelligence Test. If the test is failed, you may immediately Move the chosen model up to its Move Value following all the usual rules for Moving, including making them Charge if you wish. The chosen model may not Move later in the Move Phase, but may otherwise act normally."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Fearless"
    ]
  },
  "The Black Riders": {
    "additional_rules": [
      {
        "description": "This Army may only ever include a maximum of 9 models: 8 Ringwraiths and the Witch-king."
      },
      {
        "description": "A Black Riders Army must always contain the Witch-king of Angmar, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "Terror in the night",
        "description": "An enemy model within the range of multiple friendly Ringwraith models' Harbinger of Evil special rule will suffer a -2 penalty to their Courage Test rather than -1."
      },
      {
        "title": "The Will of Sauron",
        "description": "Friendly Ringwraith models do not lose a Will Point for being Engaged in Combat as per the Will of Evil special rule."
      },
      {
        "title": "Screech of the Nazgûl",
        "description": "A friendly Ringwraith model can use this special rule at the start of their Activation. If they do, choose an enemy model within 12\" and Line of Sight of the Ringwraith. The chosen model is immediately subject to the Transfix Magical Power, which will count as being Cast on a 6 - they may take a Resist Test as normal. A Ringwraith model that uses this special rule cannot also Cast a Magical Power during their Activation. Only a single Ringwraith can use this special rule each turn, and each Ringwraith can only use this special rule once per game."
      },
      {
        "title": "Hunt the Ringbearer",
        "description": "At the start of the Fight Phase, before any other Heroic Actions are declared, a single friendly Ringwraith may declare a Heroic Combat for free. This can only be done if, should the Heroic Combat be successful, the Ringwraith could Charge the Ringbearer. If the Heroic Combat is successful, the Ringwraith must Charge the Ringbearer, though any other models involved in the Heroic Combat may act as normal.\n\nIf both players declare a Heroic Combat in the Fight Phase in which this special rule is used, this player will automatically win the roll-off to see which Heroic Combat goes first; however, this Heroic Combat declared by this special rule must be the one chosen to go first."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "The Eagles": {
    "additional_rules": [
      {
        "description": "The Eagles may not include more Fledgeling Great Eagles than Great Eagles."
      }
    ],
    "special_rules": [
      {
        "title": "\"The Eagles are Coming!\"",
        "description": "Friendly Eagle models gain a bonus of +1 to their Strength on a turn in which they Charge."
      },
      {
        "title": "Piercing Cry",
        "description": "Once per game, at the start of any Move Phase, Gwaihir can use this special rule so long as he is alive and on the battlefield. If he does, then enemy models within 6\" of Gwaihir cannot Move during that turn, but may otherwise act normally."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "The Easterlings": {
    "additional_rules": [
      {
        "description": "An Easterlings Army must always contain Amdûr, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "No quarter was asked...",
        "description": "Friendly Easterling models gain a bonus of +1 to any Courage Tests they are required to take once their Army is Broken. Additionally, once per game in Scenarios in which a dice is rolled to see when the game ends, you may choose to have the dice re-rolled if the Scenario ends before you wish it to."
      },
      {
        "title": "Press the advantage",
        "description": "Whilst the enemy Army is Broken, friendly Easterling Hero models gain the Fearless special rule."
      },
      {
        "title": "Raze the White City",
        "description": "Friendly models gain the Ancient Enemies (Gondor) special rule."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Fearless",
      "Ancient Enemies (Gondor)"
    ]
  },
  "The Fellowship": {
    "additional_rules": [
      {
        "description": "The Fellowship is always deployed as a single Warband."
      }
    ],
    "special_rules": [
      {
        "title": "\"You have my sword\"",
        "description": "So long as Frodo is alive and on the battlefield, friendly Fellowship models gain the Fearless special rule.  Additionally, a Fellowship Army can never be considered Broken whilst Frodo is alive, even if he escapes the battlefield in Scenarios where this applies."
      },
      {
        "title": "The Bond of Fellowship",
        "description": "Friendly models within 3\" of another friendly Fellowship model may re-roll a single failed To Wound roll when making Strikes."
      },
      {
        "title": "Traverse the Wilderness",
        "description": "Friendly Fellowship models gain the Woodland Creature and Mountain Dweller special rules."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Fearless",
      "Mountain Dweller",
      "Woodland Creature"
    ]
  },
  "The Fiefdoms": {
    "additional_rules": [
      {
        "description": "Warrior models with one of the following keywords may only be included in your Army if your Army also includes a Hero with the same keyword: Dol Amroth, Lossarnach, Lamedon, Blackroot Vale."
      }
    ],
    "special_rules": [
      {
        "title": "\"For the White City!\"",
        "description": "The first turn in which this Army would be Broken and therefore have to take Courage Tests as a result of being a Broken Army, all friendly models will automatically pass Courage Tests for being Broken that turn."
      },
      {
        "title": "Leaders of the Fiefdoms",
        "description": "If a friendly Hero Charges into Combat, then during the Fight Phase, friendly Infantry models within 6\" of the Hero that share both of the same Faction Keywords as the Hero gain an additional +1 bonus To Wound when making Strikes."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "The Grey Company": {
    "additional_rules": [
      {
        "description": "A Grey Company Army must always contain Aragorn, who is always the Army's General."
      },
      {
        "description": "A Grey Company Army may be deployed as a single Warband, with Aragorn as the Warband's Captain, regardless of the number of models."
      }
    ],
    "special_rules": [
      {
        "title": "The Heir of Isildur",
        "description": "Aragorn does not have to pay any points for Andúril, Flame of the West; he automatically has this upgrade - it is free."
      },
      {
        "title": "\"They're dangerous folk, wandering the wilds\"",
        "description": "Rangers of the North increase their Attacks value to 2."
      },
      {
        "title": "Passing of the Grey Company",
        "description": "Rangers of the North may benefit from the Stand Fast of any friendly Unique Hero model."
      },
      {
        "title": "Masters of the Wild",
        "description": "Friendly models are not slowed by difficult terrain of any type."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "The Grief of Eomer": {
    "additional_rules": [
      {
        "description": "A Grief of Éomer Army must always contain Éomer, who is always the Army's General."
      },
      {
        "description": "Rohan Warrior models can only be included in the Warband of a Rohan Hero."
      },
      {
        "description": "Gondor Warrior models can only be included in the Warband of a Gondor Hero."
      }
    ],
    "special_rules": [
      {
        "title": "Éomer's Wrath",
        "description": "Éomer is always treated as being under the effects of his The Price of Grief special rule. Additionally, Éomer gains a bonus of +1 to his Fight Value on a turn in which he Charges."
      },
      {
        "title": "Fear no enemy",
        "description": "Éomer gains the Fearless special rule. Additionally, friendly Rohan models that can draw Line of Sight to Éomer automatically pass any Courage Tests they are required to take."
      },
      {
        "title": "Ride of Dol Amroth",
        "description": "Friendly Gondor models may re-roll To Wound Rolls of a natural 1 when making Strikes in a turn in which they Charged."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Fearless"
    ]
  },
  "The Iron Hills": {
    "additional_rules": [
      {
        "description": "An Iron Hills Army must include Dain Ironfoot, who is always the Army's General."
      }
    ],
    "special_rules": [
      {
        "title": "\"Ironfoot has come!\"",
        "description": "In Scenarios where you roll for Warbands to arrive, or ones where you roll to see which part of the board you deploy a Warband in (though not when rolling to choose deployment zones), you may modify the roll for Warbands from this Army by +1 or -1."
      },
      {
        "title": "Yanâd Durinul",
        "description": "Friendly Infantry models may re-roll To Wound Rolls of a natural 1 when making Strikes, so long as they are in base contact with 2 or more friendly Infantry models."
      },
      {
        "title": "Long March from the Iron Hills",
        "description": "Friendly models gain the Mountain Dweller special rule."
      },
      {
        "title": "\"I've always found Thorin the more reasonable of the two...\"",
        "description": "Dain gains the Master of Battle (5+) special rule."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Mountain Dweller"
    ]
  },
  "The Last Alliance": {
    "additional_rules": [
      {
        "description": "A Last Alliance Army must include at least one Unique Numenor Hero and at least one Unique Rivendell Hero."
      },
      {
        "description": "Numenor Warrior models can only be included in the Warband of a Numenor Hero."
      },
      {
        "description": "Rivendell Warrior models can only be included in the Warband of a Rivendell Hero."
      }
    ],
    "special_rules": [
      {
        "title": "Whirl of Steel",
        "description": "Whenever a friendly Rivendell Infantry model that is not Engaged in Combat is Charged, they may roll a D6. On a natural 6, the model that Charged them immediately suffers a Wound. If this model was a Cavalry model, roll a further D6. On a 1-3 it will be the Mount that suffers the Wound, on a 4+ it will be the rider that suffers the Wound. This is considered an Active ability."
      },
      {
        "title": "\"There were some who resisted\"",
        "description": "Friendly models may re-roll any dice that roll a 1 when making Courage Tests."
      },
      {
        "title": "Strength of Numenor",
        "description": "Whilst being Supported by or Supporting a friendly Rivendell model, friendly Numenor models may re-roll To Wound Rolls of a natural 1 when making Strikes."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "The Serpent Horde": {
    "additional_rules": [
      {
        "description": "A Serpent Horde Army must always contain Suladân, who is always the Army's General."
      },
      {
        "description": "A Serpent Horde Army may have up to 50% of its Warrior models armed with bows rather than the usual 33%."
      }
    ],
    "special_rules": [
      {
        "title": "The Scorpion's Sting",
        "description": "Friendly models with the Poisoned Attacks (bow) special rule exchange it for Poisoned Attacks on all of their weapons."
      },
      {
        "title": "Suladân's Bodyguard",
        "description": "So long as Suladân has Will Points remaining, friendly Elite models gain the Sworn Protector (Suladân) special rule."
      },
      {
        "title": "Lethal Toxins",
        "description": "Once per game, at the start of any Fight Phase, Suladân can use this special rule so long as he is alive and on the battlefield. If he does, then friendly Harad models gain the Bane of Kings special rule until the End Phase of the turn. This is treated as an Active ability belonging to Suladân."
      }
    ],
    "bow_limit": 0.5,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Poisoned Attacks (bow)",
      "Sworn Protector (Suladan)",
      "Bane of Kings"
    ]
  },
  "The Shire": {
    "additional_rules": [
      {
        "description": "When writing an Army List for The Shire, if the Army contains only Hero models a player can either have models in a single Warband or as multiple smaller warbands as normal."
      }
    ],
    "special_rules": [
      {
        "title": "Bilbo's Magic Ring",
        "description": "In this Army List, Bilbo carries the One Ring instead of Frodo."
      },
      {
        "title": "\"This'll be a night to remember\"",
        "description": "Friendly models may re-roll failed Courage Tests. Additionally, friendly models cannot have their Courage Tests reduced by the special rules or Magical Powers of enemy models."
      },
      {
        "title": "The Grey Wizard",
        "description": "Friendly models may benefit from Gandalf's Stand Fast. Additionally, Gandalf may use two fireworks each Shoot Phase rather than one, though they must be different fireworks and target different models."
      },
      {
        "title": "A Long-expected Party",
        "description": "Friendly models will pass a Fate Roll on a 3+ rather than a 4+. Additionally, friendly models may re-roll failed Fate Rolls."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "The Spider Queen's Brood": {
    "additional_rules": [
      {
        "description": "The Spider Queen’s Brood Army must always contain The Spider Queen, who is always the Army’s General."
      },
      {
        "description": "Friendly models can still pick up Objective Markers even though they have the Beast keyword."
      }
    ],
    "special_rules": [
      {
        "title": "Beasts of the Forest",
        "description": "Warbands from this Army do not need a Hero to lead them if they number six or more models. Instead, one Warrior model within the Warband takes on the role of the Warband’s Captain for the purposes of deployment. Warbands without a Hero model leading them may not include more than 12 models."
      },
      {
        "title": "“Worse are the Webs”",
        "description": "After both sides have deployed, but before the first turn begins, a player using this Army List may place four 25mm Web Markers on the board. Web Markers cannot be set up within 3\" of an enemy model or Objective Marker, and cannot be set up within 6\" of the edge of the board or within 9\" of another Web Marker. Any non-Spider model within 3\" of a Web Marker is considered to be in Difficult Terrain. Additionally, Spider models do not need Line of Sight to Charge a model within 3\" of a Web Marker."
      },
      {
        "title": "Protect the Queen",
        "description": "Whenever the Spider Queen suffers a Wound, before any Fate Rolls are made, she may roll a D6. On a 3+, she may choose a single friendly Spider model within 1\" to immediately suffer the Wound instead of her."
      },
      {
        "title": "Pounce",
        "description": "When a friendly Spider Warrior model Charges an enemy Infantry model, they gain the Knock to the Ground bonus as if they were Cavalry. This bonus is lost if they are subsequently Charged by an enemy Cavalry model."
      },
      {
        "title": "The Queen’s Cunning",
        "description": "If the Spider Queen declares a Heroic Move in the same turn as an enemy Hero, and subsequently loses the roll-off to see which Heroic Move will go first, she may choose to cancel her Heroic Move and regain the Might point spent to declare it."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [],
    "legacy": true
  },
  "The Three Trolls": {
    "additional_rules": [
      {
        "description": "The Three Trolls must always include Bill, Bert and Tom. Bill is always the Army's General."
      },
      {
        "description": "A Three Trolls Army may have Bill, Bert and Tom in the same Warband, with Bill as the Warband's Captain."
      }
    ],
    "special_rules": [
      {
        "title": "The Campfire",
        "description": "After both Armies have been deployed, you may place the Campfire anywhere on the battlefield outside of your opponent's deployment zone. The Campfire is on an 80mm base, and must be placed flat on the battlefield. Friendly Troll models treat the Campfire as a banner with a range of 6\", and gain the Resistant to Magic special rule and a bonus of +1 to any Courage Tests whilst within 6\" of it."
      },
      {
        "title": "A Troll's Hoard",
        "description": "The Three Trolls Army works in an unusual way in that they are allowed to purchase additional special rules. Each of the special rules listed below can be purchased for 50 points, allowing The Three Trolls to be taken at many different points values and not just at 400 points."
      },
      {
        "title": "Full Bellies",
        "troll_purchase": true,
        "description": "Bill, Bert and Tom increase their starting Might, Will and Fate Points to 3."
      },
      {
        "title": "Stone Troll Endurance",
        "troll_purchase": true,
        "description": "Each time Bill, Bert or Tom is wounded, roll a D6. On a natural 6, the Wound is ignored."
      },
      {
        "title": "Nothing like a warm fire",
        "troll_purchase": true,
        "description": "The range of the Campfire's effects are increased from 6\" to 18\". Additionally, as long as there are no enemy models in base contact with the Campfire at the end of the game, the Campfire will count as a banner for the purpose of Victory Points in Scenarios that award Victory Points for having a banner left alive."
      },
      {
        "title": "Rumbling Momentum",
        "troll_purchase": true,
        "description": "Bill, Bert and Tom increase their Attacks to 4 on a turn in which they Charge."
      },
      {
        "title": "Bowl them over",
        "troll_purchase": true,
        "description": "Instead of using their Throw Stones special rule as normal, Bill, Bert and Tom may use stones in the same way as a Throwing Weapon. These have a Strength of 8 and a range of 12\". Additionally, Bill, Bert and Tom may re-roll the dice when determining the Hurl Distance when using the Hurl Brutal Power Attack."
      },
      {
        "title": "Dominant presence",
        "troll_purchase": true,
        "description": "Whilst either Bill, Bert or Tom are within 3\" of an Objective Marker, they are automatically considered to be holding it and the opposition are considered to have no models within range of the Objective Marker. If models from both sides have a special rule that confers this effect, and the applicable models are within range of the same Objective Marker, then neither Army will get their corresponding special rule."
      },
      {
        "title": "Savvy Fighters",
        "troll_purchase": true,
        "description": "Bill, Bert and Tom all gain Heroic Strike if they didn't already have it. Additionally, whenever an enemy model Engaged in Combat with Bill, Bert or Tom declares a Heroic Strike, roll a D6. On a 4+, the Troll in the same fight may declare a Heroic Strike for free."
      },
      {
        "title": "Tasty Livestock",
        "troll_purchase": true,
        "description": "After both sides have deployed, but before the first turn begins, a player using The Three Trolls may place four 25mm Livestock Markers on the board. Livestock Markers cannot be set up within 3\" of an enemy model or Objective Marker, and cannot be set up within 6\" of the edge of the board or another Livestock Marker. If, during their Activation, Bill, Bert or Tom are within 3\" of a friendly Livestock Marker they can remove it from the battlefield and immediately regain 1 Wound lost earlier in the battle."
      },
      {
        "title": "Cover of Darkness",
        "troll_purchase": true,
        "description": "At the start of each game using this Army List, you may choose for the Scenario to take place at night if you wish. Additionally, Bill, Bert and Tom gain the Cave Dweller special rule."
      },
      {
        "title": "Troll Cunning",
        "troll_purchase": true,
        "description": "Bill, Bert and Tom can never be Trapped whilst still standing. Additionally, Bill, Bert and Tom may re-roll any failed To Wound Rolls when making Strikes against a Trapped model."
      },
      {
        "title": "Kitchen Utensils",
        "troll_purchase": true,
        "description": "Bill, Bert and Tom may re-roll any To Wound Rolls of a natural 1 when making Strikes."
      },
      {
        "title": "\"That's Mine That Is!\"",
        "troll_purchase": true,
        "description": "At the start of their Activation, Bill, Bert or Tom may place a single 25mm Stash Marker in base contact with themself. Each Troll may only have a single Stash Marker on the board at a time. If a Stash Marker is within range of an Objective Marker, then it will count as a single friendly Warrior model for the purposes of working out how many models control that Objective Marker. An enemy model may remove a Stash Marker if they are in base contact with it during the End Phase of any turn, provided they have not Cast any Magical Powers, used a Missile Weapon, been Engaged in Combat, Supported a Combat, been rendered unable to Move that turn due to a special rule or result of a test (such as a Thrown Rider test) or been under the effects of an enemy Magical Power that turn."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Cave Dweller",
      "Resistant to Magic"
    ]
  },
  "The White Council": {
    "additional_rules": [
      {
        "description": "A White Council Army is always deployed as a single Warband, with your General as the Warband's Captain."
      },
      {
        "description": "Gandalf, Radagast and Elrond gain the White Council keyword."
      }
    ],
    "special_rules": [
      {
        "title": "Council of the Wise",
        "description": "Each friendly White Council model gains the special rule associated with them as listed below:\n\nSaruman - Friendly White Council models within 3\" of Saruman may re-roll any 1s in their rolls to Cast a Magical Power.\n\nGandalf - Friendly White Council models within 3\" of Gandalf may re-roll To Wound Rolls of a natural 1 when making Strikes.\n\nRadagast - Friendly White Council models that begin their Activation within 3\" of Radagast may Move through difficult terrain without penalty.\n\nElrond - Friendly White Council models treat Elrond as a banner.\n\nGaladriel - Friendly White Council models within 3\" of Galadriel gain the Resistant to Magic special rule."
      },
      {
        "title": "Masters of Magic",
        "description": "Friendly White Council models may still be Activated whilst Engaged in Combat (though they still may not Move), and therefore may attempt to Cast Magical Powers whilst Engaged in Combat, with the exception of the following Magical Powers: Nature's Wrath, Sorcerous Blast, Wrath of Bruinen."
      },
      {
        "title": "\"Are you in need of assistance?\"",
        "description": "Friendly White Council models gain a bonus of +1 to any Resist Tests whilst within 6\" of another friendly White Council model."
      },
      {
        "title": "Last Stand of the Council",
        "description": "Friendly White Council models gain the Dominant (3) special rule."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Resistant to Magic"
    ]
  },
  "Thorin's Company": {
    "additional_rules": [
      {
        "description": "A Thorin's Company Army must include Thorin Oakenshield, who is always the Army's General."
      },
      {
        "description": "All Thorin's Company models must be included in Thorin's Warband."
      },
      {
        "description": "You may only include Eagle models in your Army if it also includes Gandalf."
      },
      {
        "description": "Great Eagles may only be included in Gwaihir's Warband."
      }
    ],
    "special_rules": [
      {
        "title": "March to the Lonely Mountain",
        "description": "If your Army contains only Thorin's Company models, then friendly Dwarf models may spend their Will Points to declare a Heroic March instead of using Might Points, even if they do not normally have the ability to declare a Heroic March."
      },
      {
        "title": "\"We're making a long-term deposit\"",
        "description": "At the beginning of the game, choose one Objective Marker on the board. Friendly Dwarf models within range of the chosen Objective Marker gain the Dominant (2) special rule."
      },
      {
        "title": "Family Ties",
        "description": "The Dwarves of Thorin's Company are divided into Family Groups, which are as follows:\nBalin and Dwalin.\nKili and Fili.\nBifur, Bofur and Bombur.\nOri, Nori and Dori.\nOin and Gloin.\n\nHero models from this Army that are within 3\" of another Hero from the same Family Group may spend that model's Might, Will and Fate points as if they were their own."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Ugluk's Scouts": {
    "additional_rules": [
      {
        "description": "An Ugluk's Scouts Army must always contain Ugluk, who is always the Army's General."
      },
      {
        "description": "Orc Warrior models can only be included in the Warband of an Orc Hero."
      },
      {
        "description": "Uruk-hai Warrior models can only be included in the Warband of an Uruk-hai Hero."
      }
    ],
    "special_rules": [
      {
        "title": "\"Their pace has quickened\"",
        "description": "Friendly Uruk-hai models increase their Move Value to 8\".  Additionally, friendly Uruk-hai models gain the Woodland Creature special rule."
      },
      {
        "title": "\"Get a fire going\"",
        "description": "Once per game, in Scenarios that use Objective Markers, Ugluk can use this special rule during his Move to choose an Objective Marker in base contact. So long as Ugluk is alive and on the battlefield, friendly models within range of the chosen Objective Marker gain the Dominant (2) special rule."
      },
      {
        "title": "Animosity",
        "description": "Friendly Orc models gain a bonus of +1 To Wound when making Strikes if there is a friendly Uruk-hai model Engaged in the same Combat. Friendly Uruk-hai models gain a bonus of +1 To Wound when making Strikes if there is a friendly Orc model Engaged in the same Combat."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Woodland Creature"
    ]
  },
  "Umbar": {
    "additional_rules": [
      {
        "description": "An Umbar Army must always contain at least one Hâsharin."
      }
    ],
    "special_rules": [
      {
        "title": "Seize Command",
        "description": "If during the End Phase of any turn, your General has only a single Wound remaining and is within 3\" and Line of Sight of a friendly Hâsharin, you may choose to remove your General as a casualty. If you do, you may immediately choose another friendly Hero to be your new General (this must still be a Hero with the highest Heroic Tier remaining). The previous model loses the General keyword and no longer counts as a General for the purpose of special rules or Victory Points. If a Hâsharin is your General, they cannot use this special rule to kill themselves – a different Hâsharin would have to be within 3\" to use this special rule."
      },
      {
        "title": "Shadows of Umbar",
        "description": "Friendly models gain the Stalk Unseen special rule."
      },
      {
        "title": "Death to Gondor",
        "description": "Friendly models gain the Hatred (Gondor) special rule."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [
      "Stalk Unseen",
      "Hatred (Gondor)"
    ]
  },
  "Usurpers of Edoras": {
    "additional_rules": [
      {
        "description": "If your Army includes Freca, then he must be your General."
      },
      {
        "description": "Rohirrim Traitors can only be included in Lord Thorne's Warband."
      }
    ],
    "special_rules": [
      {
        "title": "Whipped into a frenzy",
        "description": "Whenever a Hill Tribesman or Hill Tribes Chieftain suffers a Wound roll a D6. On a natural 6, the Wound is ignored."
      },
      {
        "title": "Barbarous Killers",
        "description": "Friendly Dunland models gain a bonus of +1 To Wound when making Strikes against enemy Hero models."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Variags of Khand": {
    "additional_rules": [
      {
        "description": "A Variags of Khand Army must always contain a Khandish King, who is always the Army's General."
      },
      {
        "description": "Khandish Horsemen and Khandish Charioteers do not count towards this Army’s bow limit."
      }
    ],
    "special_rules": [
      {
        "title": "High King of Khand",
        "description": "The Khandish King that is your General gains an additional Might Point. Additionally, so long as he is alive and on the battlefield, your General counts as a banner for the purpose of Victory Points."
      },
      {
        "title": "Khandish Fury",
        "description": "Once per game, at the start of any Fight Phase, you can declare that you are using this ability so long as there is at least one friendly Hero model alive and on the battlefield. If you do, then until the end of the turn friendly Warrior models that are within 3\" of a friendly Hero model gain a bonus of +1 to their Fight Value."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": [],
    "legacy": true
  },
  "Wolf Pack of Angmar": {
    "additional_rules": [
      {
        "description": "Werewolves may benefit from the Heroic Actions and Stand Fast of friendly Wild Warg Chieftains even though they do not have the Warg keyword."
      },
      {
        "description": "Friendly models can still pick up Objective Markers even though they have the Beast keyword."
      }
    ],
    "special_rules": [
      {
        "title": "Leader of the Pack",
        "description": "The Wild Warg Chieftain that is your General gains an additional point each of Might, Will and Fate."
      },
      {
        "title": "Feral Charge",
        "description": "When a friendly Warg model Charges an enemy Infantry model, they gain the Knock to the Ground bonus as if they were Cavalry. This bonus is lost if they are subsequently Charged by an enemy Cavalry model."
      },
      {
        "title": "Protect the Alpha",
        "description": "If your General has suffered at least one Wound, then friendly models treat them as a banner with a range of 6\"."
      },
      {
        "title": "Howl of the Wolf Pack",
        "description": "Once per game, at the start of any Fight Phase, your General can declare they are using this ability. Until the End Phase of the turn, friendly models gain a bonus of +1 to their Fight Value and may re-roll To Wound Rolls of a natural 1 when making Strikes."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Wolves of Isengard": {
    "additional_rules": [
      {
        "description": "A Wolves of Isengard Army must always contain Sharku, who is always the Army's General."
      },
      {
        "description": "A Wolves of Isengard Army may have up to 50% of its Warrior models armed with throwing weapons rather than the usual 33%."
      }
    ],
    "special_rules": [
      {
        "title": "Leader of the Pack",
        "description": "Sharku may declare a Heroic Combat each turn for free."
      },
      {
        "title": "Savage Charge",
        "description": "Friendly Cavalry models still gain the Extra Attack bonus even when they Charge a Cavalry model, and will retain it even if they are subsequently Charged by a Cavalry model."
      },
      {
        "title": "Warg Scouts",
        "description": "At the start of the game after both sides have deployed but before the first Priority has been rolled, you may select up to D6 friendly Warrior models. The selected models may immediately Move as if it were the Move Phase, and then make a shooting attack as if it were the Shoot Phase. During this Move, friendly models may not Move within 1\" of an enemy model and therefore may not Charge. In Scenarios where models enter the board, the selected models will Move onto the board before the first turn of the game, treating any roll to enter the board as a 6. Each model is treated as a separate Warband in this instance."
      },
      {
        "title": "Ambush",
        "description": "In Scenarios that use the Maelstrom of Battle special rule a Wolves of Isengard Army will automatically win the roll to choose who has Priority on the first turn. If both Armies have rules that allow them to do this, roll for Priority as normal. Additionally, models from this Army may Charge on the turn they enter the board, even though they may not normally be allowed to do so. Models Charging in this manner do not need to take a Courage Test to Charge an enemy with the Terror special rule."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.5,
    "rule_highlights": []
  },
  "Wraiths on Wings": {
    "additional_rules": [
      {
        "description": "This Army may only ever include a maximum of 9 models: 8 Ringwraiths and the Witch-king."
      }
    ],
    "special_rules": [
      {
        "title": "Full Force Charge",
        "description": "The sheer weight behind the charge of a flying Fell Beast is enough to maim or crush those unfortunate to find themselves in its path. The first time a friendly Monster model Charges during its Activation, it may choose to use this special rule. If it does, each model it has Charged suffers a single Strength 5 hit. Cavalry models suffer these hits on both the Mount and the rider. If after these hits have been resolved the Monster is no longer Engaged in Combat, it may continue its Activation and may even Charge again if it wishes; though if it does, any subsequent Charges will not confer this effect."
      },
      {
        "title": "Strafing Attack",
        "description": "When a Fell Beast flies over enemy lines, it will likely grasp at those beneath in an attempt to crush them within its huge claws. At the end of a friendly Monster model's Move, if it is not Engaged in Combat, you may choose a single enemy model, that is not Engaged in Combat, that lies in the direct path between where the Monster began its Move, and where it finished its Move - the path is the same width as the Monster model's base. The chosen model suffers a Strength 5 hit and, if it survives, will be knocked Prone. Cavalry models suffer these hits on both the Mount and the rider."
      }
    ],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Custom: Good": {
    "additional_rules": [],
    "special_rules": [],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  },
  "Custom: Evil": {
    "additional_rules": [],
    "special_rules": [],
    "bow_limit": 0.33,
    "throw_limit": 0.33,
    "rule_highlights": []
  }
}