[
  {
    "name":"Ancient Enemies (X)",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"A model with this special rule must re-roll To Wound Rolls of a natural 1 when making Strikes against a model with the keywords listed in brackets in that model's profile. So, a model with the Ancient Enemies (Elf) special rule would re-roll To Wound Rolls of a natural 1 against Elf models."
  },
  {
    "name":"Arcing Shot",
    "type":"special_rule",
    "active_passive":null,
    "description":"A Siege Engine that Shoots by Arcing Shot does not need Line of Sight to its target, or to a model its shot would scatter on to, so long as another friendly model has Line of Sight to the initial target. After determining the actual target, a Siege Engine with Arcing Shot does not make In The Way Tests for intervening models and terrain (the shot goes over them). However, anything that is clearly taller than the actual target and would be above the actual target when the shot comes down will incur an In The Way Test. This could include the likes of trees, ledges, or rocks that jut out from cliff faces; a degree of common sense will be needed here - a whole tree would provide this In The Way, but a single branch would not!\n\nThis is also the case for when a Siege Engine with Arcing Shot hits a War Beast with a Howdah, as the Howdah is above the War Beast and so will provide an In The Way Test."
  },
  {
    "name":"Aura of Command",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Exhaustion\n\nThis Magical Power targets the caster. Whilst this power is in effect, the caster and all friendly models within 6\" of them automatically pass all Courage Tests they are required to take."
  },
  {
    "name":"Aura of Dismay",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Exhaustion\n\nThis Magical Power targets the caster. Enemy models within 6\" of the caster suffer a -1 penalty to any Courage Tests they are required to take."
  },
  {
    "name":"Backstabbers",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"This model receives a bonus of +1 To Wound when making Strikes against a Trapped model."
  },
  {
    "name":"Bane of Kings",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"This model must re-roll all failed To Wound Rolls when making Shooting Attacks or when making Strikes."
  },
  {
    "name":"Bane Weapons",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"A Bane Weapon will be presented as Xbane, where X is a specific Race keyword. For each successful Strike caused by a Bane Weapon (i.e., one that causes a Wound that is not prevented), the Bane Weapon will inflict D3 Wounds rather than 1 if the target of the Strike has the same keyword as the Bane Weapon. So, a weapon with the Orcbane special rule will deal D3 Wounds rather than 1 against Orc models."
  },
  {
    "name":"Banishment",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Instant\n\nThis Magical Power targets one enemy Spirit model within range. The target immediately suffers 1 Wound. If this Magical Power targets a Cavalry model, the caster must choose whether the rider or the Mount is the target."
  },
  {
    "name":"Black Dart",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Instant\n\nA sinister dark force leaps from the caster’s hand, driving itself into the flesh of its victim and towards their heart.\n\nThis Magical Power targets one enemy model within range. The target immediately suffers one Strength 6 hit. If this Magical Power targets a Cavalry model, the caster must choose whether the rider or the Mount is the target."
  },
  {
    "name":"Blades of the Dead",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"Models with this special rule don't roll To Wound when making Strikes in the same way. Instead, when a model with this special rule makes a Strike, the target counts their Defence value as 10 minus the numerical value of their Courage. So, a model with a Courage of 8+ would treat their Defence as 2 (10-8) when a model with Blades of the Dead makes a Strike against them."
  },
  {
    "name":"Bladewrath",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Temporary\n\nThis Magical Power targets one friendly model within range. In the ensuing Fight phase, all Strikes made by the target are resolved at a Strength of 6, regardless of any other modifiers."
  },
  {
    "name":"Blessing of the Valar",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Instant\n\nThis Magical Power targets one friendly model within range. The target immediately regains 1 Fate Point spent earlier in the battle."
  },
  {
    "name":"Blinding Light",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Temporary\n\nThis Magical Power targets the caster. Whilst this power is in effect, the area within 6\" of the caster is always considered to be daylight (perfect if you are playing a battle at night). Additionally, whilst this power is in effect, enemy models that make a Shooting Attack that targets a model within 6\" of the caster will only hit on a To Hit Roll of a 6. Models cannot benefit from this Magical Power if there is a piece of impassable terrain, such as a wall or building, directly between all parts of the model and the source of the light."
  },
  {
    "name":"Bodyguard",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"All models with this special rule in an Army must select a Hero to bodyguard; this will automatically be the General if they have the same Faction keyword as this model. If the General does not have the same Faction keyword as this model, then they will bodyguard the Hero with the highest Heroic Tier amongst those who have the same Faction keyword (if there are multiple of the same Heroic Tier, you may choose which will be bodyguarded). All models of the same type must choose the same Hero to bodyguard. So long as the bodyguarded Hero is alive and on the battlefield, all models who are bodyguarding that Hero will automatically pass all Courage Tests they are required to take."
  },
  {
    "name":"Burly",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"A model with this special rule does not suffer the -1 penalty to the Duel Roll for using a two-handed weapon. Additionally, a model with this special rule can still Move its full Move Value whilst carrying a Heavy Object."
  },
  {
    "name":"Call Winds",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Instant\n\nThis Magical Power targets one enemy model within range. The target is immediately blown D3+3\" directly away from the caster in a straight line. If the model comes into contact with another model or piece of terrain, then it will immediately stop. After it has been blown back, the target is knocked Prone. If the target was Engaged in Combat, the effect is the same and they can be blown out of a Combat."
  },
  {
    "name":"Cave Dweller",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"A model with this special rule applies a +1 modifier to any Jump, Leap and Climb Tests they take. Additionally, a model with this special rule suffers no penalties to how far they can see when fighting in the dark."
  },
  {
    "name":"Chill Soul",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Instant\n\nThis Magical Power targets one enemy model in range. The target immediately suffers 1 Wound. If this Magical Power targets a Cavalry model, the caster must choose whether the rider or the Mount is the target."
  },
  {
    "name":"Collapse Rocks",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Instant\n\nThis Magical Power targets one enemy model in range that is within a ruin, stone or brick building, cave, rock pile, or any other piece of terrain where the caster could crack rock from underfoot or overhead. The target suffers one Strength 7 hit and is knocked Prone. If the target was a Cavalry model, they will automatically count as suffering the Knocked Flying result on the Thrown Rider Chart."
  },
  {
    "name":"Compel",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Instant\n\nThis Magical Power targets one enemy model in range. The caster may Move the target up to half its Move Value, even if the target has already Moved this turn. They cannot Move the target out of Combat, make them take a Jump, Climb, Leap or Swim Test, let them dismount or make them dismount. They can, however, make them Move into Difficult Terrain or Charge an enemy model (if able), in which case no Courage Test would be required to Charge an enemy with the Terror special rule. They can make the target drop an Object they are carrying as part of a Scenario (but not Wargear) or put on the One Ring if they carry it. Once the target has been Moved, it cannot Move any further that turn for any reason but may otherwise act normally. If the model affected by this Magical Power would normally have to Charge as part of their Move, they are not forced to when under the influence of this Magical Power."
  },
  {
    "name":"Curse",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Instant\n\nThis Magical Power targets one enemy model in range. The target immediately loses 1 Fate Point. If this Magical Power targets a Cavalry model, the caster must choose whether the rider or the Mount is the target."
  },
  {
    "name":"Direct Shot",
    "type":"special_rule",
    "active_passive":null,
    "description":"A Siege Engine that Shoots by Direct Shot will need Line of Sight to the initial target. Additionally, if the shot scatters onto another target, the Siege Engine will need to have Line of Sight to this target in order for them to be selected as the actual target. In both of these instances, this Line of Sight is drawn from the firing point of the Siege Engine, so the tip of a ballista or siege bow for example.\n\nAfter determining the actual target, a Siege Engine with Direct Shot will make In The Way Tests in the same way as any other Shooting Attack."
  },
  {
    "name":"Dominant (X)",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"This model counts as the number of models as shown in brackets when working out how many models are in range of an objective, in a specific area of the board, or when working out how many models have escaped the battlefield. So, a model with Dominant (3) would count as three models in range of an objective, or in a specific area of the board, or three models when working out how many models have escaped the battlefield. If a model would gain this special rule whilst in range of another model or specific area of the board, and then Moves off the board, they will not gain the benefit of this special rule once off the board."
  },
  {
    "name":"Drain Courage",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Instant\n\nThis Magical Power targets one enemy model in range. The target immediately worsens their Courage value by 1 for the remainder of the game; so a model with a Courage of 5+ that is affected by this Magical Power would then have a Courage of 6+. A model can be affected by this Magical Power multiple times over the course of the battle, worsening its Courage value each time. If this Magical Power targets a Cavalry model, the caster must choose whether the rider or the Mount is the target."
  },
  {
    "name":"Enchant Blades",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Temporary\n\nThis Magical Power targets one friendly model within range. In the ensuing Fight Phase, the target may re-roll all failed To Wound Rolls when making Strikes."
  },
  {
    "name":"Enrage Beast",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Temporary\n\nThis Magical Power targets one friendly Beast model within range. The target increases its Fight Value, Strength and Attacks by 2, and gains the Fearless special rule, until the End Phase of the turn, at which point the target will immediately suffer 1 Wound."
  },
  {
    "name":"Expert Rider",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"A Cavalry model with this special rule may re-roll the dice on any Jump, Swim or Thrown Rider Tests, and can pick up Light Objects without having to Dismount. Additionally, a model with this special rule that is carrying both a bow and a shield will still get the +1 bonus to their Defence for having a shield whilst they remain mounted."
  },
  {
    "name":"Expert Shot",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"A model with this special rule can make two Shooting Attacks in the Shoot Phase rather than one. These Shooting Attacks are made one at a time and do not have to target the same enemy model, though both must be made with the same Missile Weapon."
  },
  {
    "name":"Fearful",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"If a model with this special rule wishes to Charge, then it must take a Courage Test at the start of its Move. If the test is failed, the model may not Move that turn but may otherwise act normally."
  },
  {
    "name":"Fearless",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"A model with this special rule automatically passes any Courage Test it is required to take."
  },
  {
    "name":"Fell Sight",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"A model with this special rule does not need to have Line of Sight to be able to Charge an enemy model. Additionally, a model with this special rule can Charge or target an enemy model with the Stalk Unseen special rule with no penalty. If a Mount has this special rule, the rider may benefit from it whilst they remain mounted."
  },
  {
    "name":"Flameburst",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Instant\n\nThis Magical Power targets one enemy model in range. The target immediately suffers one Strength 6 hit. This is a fire-based attack, so if a model is immune to fire-based attacks, they are immune to this Magical Power."
  },
  {
    "name":"Flaming Ammunition",
    "type":"special_rule",
    "active_passive":null,
    "description":"A Siege Engine upgrade with Flaming Ammunition may re-roll any failed To Wound rolls against a Siege Target."
  },
  {
    "name":"Fly",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"A model with this special rule ignores intervening models and terrain when it Moves – flying over buildings, woods and so on, and ignoring the vertical distance as they Move.\n\nA model that Moves in this way cannot end its Move overlapping another model, within a piece of woodland terrain, or upon any surface in which it cannot balance safely (flat rock and hills are fine, but don’t try perching a model upon a sloped roof for example). Additionally, a model that Moves in this way cannot finish its Move atop a piece of terrain which it is impossible for the enemy to reach, such as at the top of a sheer rock face with no way up, or straddling one or more pieces of terrain that would allow other models to Move underneath.\n\nIf a model wishes to do something part way through its Move whilst it is Flying (such as Cast a Magical Power), then it must land in order to do so. When a model lands, there cannot be any models underneath it, and if it lands in an enemy model’s Control Zone then it must Charge that enemy model.\n\nA model with this special rule can choose not to Fly, and in which case will treat its Move Value as 4” rather than that listed in its profile (usually 12”). If it does, then it gains none of the benefits of the Fly special rule, though it may enter a piece of woodland terrain; however, if it enters a piece of woodland terrain, it cannot elect to Fly again until it has completely left the woods.\n\nA model that chooses to Fly will ignore enemy Control Zones as it Moves. A model that wishes to Charge when it is flying can Charge any model whose Control Zone it finishes its Move in. If a Flying model wishes to Charge a model that is already Engaged in Combat (or has otherwise lost their Control Zone) then it can only do so if it can land in a position where is is not within the Control Zones of other enemy models."
  },
  {
    "name":"Fog of Disarray",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Exhaustion\n\nThis Magical Power targets the caster. Enemy models within 6\" of the caster suffer a -1 penalty to any Intelligence Tests they are required to take."
  },
  {
    "name":"Foil Magic",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Instant\n\nThis Magical Power targets one enemy model within range. The caster may choose one Magical Power Cast by the target with the Exhaustion duration that is currently in play. That Magical Power immediately ends."
  },
  {
    "name":"Fortify Spirit",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Exhaustion\n\nThis Magical Power targets one friendly model within range. Each time the target becomes the target of a Magical Power Cast by an enemy model, they gain an additional free dice to try to Resist. This free dice can still be rolled even if the target has no Will Points or chooses not to use any from their store."
  },
  {
    "name":"Foul Temperament",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"The Mumak has 4 Attacks, but suffers a -1 penalty to its Courage Tests when seeing if it will Stampede."
  },
  {
    "name":"Fury (X)",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Exhaustion\n\nThis Magical Power targets the caster. Friendly models within 6\" of the caster who have the same keyword as those shown in brackets will automatically pass any Courage Tests they are required to take."
  },
  {
    "name":"General Hunter",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"If this model slays the enemy General in a Combat, they immediately regain a single point of Might spent earlier in the battle."
  },
  {
    "name":"Gnarled Hide",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"The Mumak has a Defence of 8 rather than 7."
  },
  {
    "name":"Harbinger of Evil (X)",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"An enemy model within the range shown in brackets in this model's profile suffers a -1 penalty to any Courage Tests it is required to make. This is not cumulative with other special rules that also provide a similar effect. A model with this special rule is unaffected by the Harbinger of Evil special rule of enemy models."
  },
  {
    "name":"Hatred (X)",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"A model with this special rule gains a bonus of +1 To Wound when making Strikes against a model with the same keyword as the one shown in brackets. So, a model with the Hatred (Man) special rule would gain a bonus of +1 To Wound when making Strikes against Man models."
  },
  {
    "name":"Heroic Accuracy",
    "type":"heroic_action",
    "active_passive":null,
    "description":"(Shoot Phase) When a Hero declares a Heroic Accuracy, they gain the Sharpshooter special rule until the End Phase of the turn if they don't already have it. Additionally, the Hero may re-roll any failed In The Way Tests when making a Shooting Attack. This includes any failed In The Way Tests when targeting a Cavalry model with a Shooting Attack to determine whether the target part of the model has been hit.\n\nA Hero may not declare a Heroic Accuracy if they are Engaged in Combat or otherwise rendered unable to Activate.\n\n<b>Take Aim<\/b> - A Hero who is performing a Heroic Accuracy may choose to shout \"Take Aim\". The Hero does not need to Shoot first (or at all if they don't wish to) when they shout Take Aim.\n\nIf they do, all friendly models within 6\" of the Hero when they shout Take Aim are automatically affected, and may also re-roll any failed In The Way Tests when making a Shooting Attack. This includes any failed In The Way Tests when targeting a Cavalry model with a Shooting Attack to determine whether the target part of the model (usually the rider) has been hit.\n\nFriendly models affected by the Take Aim of a friendly Hero do not need to target the same enemy model, and may Shoot as normal."
  },
  {
    "name":"Heroic Challenge",
    "type":"heroic_action",
    "active_passive":null,
    "description":"(Fight Phase) When a Hero declares a Heroic Challenge they must also declare an enemy Hero within 6\" of them, with the same Heroic Tier or higher, to be the target of the Heroic Challenge. If there is no enemy Hero within 6\" with the same Heroic Tier or higher, then the Hero cannot declare a Heroic Challenge.\n\nWhilst Engaged in Combat with their taget, the Hero gains a bonus of +1 Attack (both in the Duel Roll and when making Strikes) and a bonus of +1 To Wound when making Strikes against their target. Additionally, if they slay their target (i.e., they inflict the final Wound that causes them to be removed as a casualty) then the Hero immediately gains 1 Might Point, though this cannot take them above their starting limit.\n\nThe target of the Heroic Challenge can choose to either accept or decline the challenge. If they accept, then they get the same benefits as the Hero who declared the Heroic Challenge, as listed above (as if the Hero who declared the Heroic Challenge was their target). Additionally, if the target chooses to accept, then when either Hero Activates, they must Charge each other if possible. A Hero who accepts a Heroic Challenge cannot declare a Heroic Challenge themselves until the Hero who challenged them is slain. If a Hero accepts a Heroic Challenge, no other Hero may declare a Heroic Challenge against either Hero involved in the Heroic Challenge until one of them has been slain.\n\nIf the target declines, then they gain none of the benefits listed, though the Hero who declared the Heroic Challenge will still gain them. Additionally, if the target declines, they cannot then themselves declare a Heroic Challenge against the Hero who they declined against.\n\nA Hero who has already issued a Heroic Challenge against a target cannot declare another Heroic Challenge until their target has been removed as a casualty."
  },
  {
    "name":"Heroic Channelling",
    "type":"heroic_action",
    "active_passive":null,
    "description":"(Move Phase) A Hero who declares Heroic Channelling will count the result of their next Casting Test this turn as a 6. As a result, they do not need to roll the dice for the Casting Test but will still need to spend a Will Point to Cast the Magical Power as normal."
  },
  {
    "name":"Heroic Combat",
    "type":"heroic_action",
    "active_passive":null,
    "description":"(Fight Phase) When a Hero declares a Heroic Combat, their Combat is resolved first before any others. In addition, if the Hero wins their Combat and all enemy models involved in that Combat are removed as a casualty, then the Hero and any friendly models that were involved in that Combat (with the exception of any War Beast or Chariot models) may immediately Move in the same way as they would during the Move Phase - however, the only things they may do is to Move or Charge. If they Charge, then they will fight again in the ordinary way i.e., in an order chosen by the player with Priority.\n\nIf models Charge during this Move, then the way the Combats should be divided may be altered. In this situation, the player with Priority will Pair Off Combats again after each successful Heroic Combat.\n\nA model may only benefit from one Heroic Combat per turn; so, if a model that was involved in one Heroic Combat Moves to join another Combat that is also a Heroic Combat, which is then itself successful, the model may then not Move again as part of the second Heroic Combat.\n\nThere may be a situation where two opposing Hero models in the same Combat both declare a Heroic Combat. When this happens, if either side causes all enemy models to be removed as a casualty, then they are considered to have made a successful Heroic Combat and may Move as described above, regardless of which player's choice of Heroic Combat it was."
  },
  {
    "name":"Heroic Defence",
    "type":"heroic_action",
    "active_passive":null,
    "description":"(Fight Phase) A Hero model that declares a Heroic Defence will only suffer a Wound on the roll of a natural 6 in the ensuing Fight Phase, regardless of any special rules, modifiers, Brutal Power Attacks or the use of Might. If the Hero would normally be wounded on a 6+\/4+, 6+\/5+ or 6+\/6+, then they will only be wounded if both rolls are a natural 6. Heroic Defence does not confer to a Hero model's Mount if it has one."
  },
  {
    "name":"Heroic March",
    "type":"heroic_action",
    "active_passive":null,
    "description":"(Move Phase) A Hero who declares a Heroic March adds 3\" to their Move Value for the duration of the Move Phase if they have the Infantry, Chariot or War Beast keyword; if they have the Cavalry keyword or have the Fly special rule, then they add 5\" to their Move Value instead. Additionally, the Hero may not Charge under any circumstances during the same Move Phase.\n\nIf a Hero who has declared a Heroic March is Charged and Engaged in Combat, or rendered unable to Activate in some other way, then their Heroic March is cancelled and the Might Point spent is lost.\n\n<b>At the Double<\/b> - A Hero who is performing a Heroic March may choose to shout \"At the Double\" as soon as they are Activated. If they do, note their starting position before they Activate. All friendly models within 6\" of the Hero when they shout At the Double are automatically affected and, after the Hero model has Activated, gain the following benefit: A model affected by At the Double adds 3\" to their Move Value for the duration of the Move Phase if they have the Infantry, Chariot or War Beast keyword; if they have the Cavalry keyword or have the Fly special rule, then they add 5\" to their Move Value instead. Additionally, the model may not Charge under any circumstances during the same Move Phase.\n\nModels affected by At the Double must finish their Activation within 6\" of the Hero that shouted At the Double. If the model attempts to finish their Activation within 6\" of the Hero, but fails a roll (such as a Courage Test, Jump Test or Climb lest) that makes this impossible, they simply stop where they are. A model that cannot finish their Activation within 6° of the Hero who shouted At the Double must forego their Activation, and cannot be Activated later on in the same Move Phase. Models can choose not to Activate when affected by a Heroic March, in which case they will also forego their Activation.\n\nShould the Hero be removed as a casualty for any reason (such as fleeing or suffering Falling Damage) then their Heroic March and At the Double will immediately be cancelled.\n\nModels can only ever be affected by one Hero model's At the Double each turn-you can't stack multiple Heroic Marches together!\n\nIf a Hero who shouted At the Double Moves off the board, then any friendly models who are affected by their At the Double may also Move off the board if able; however, if they cannot then they must choose to forego their Activation. If a model is affected by a Hero model's At the Double, then they can only Move off the board if that Hero also does so."
  },
  {
    "name":"Heroic Move",
    "type":"heroic_action",
    "active_passive":null,
    "description":"(Move Phase) A Heroic Move enables a Hero to Activate before other models – essentially defying the usual Priority system. The Hero can then Activate exactly as normal and do anything they would normally be able to do when they Activate. The Hero cannot then be Activated again later in the Move Phase.\n\nThis Heroic Action can prove extremely valuable, and often when the player without Priority declares a Heroic Move their opponent will also declare one in order to try to keep the initiative.\n\nIf a Hero who has declared a Heroic Move is Charged and Engaged in Combat, or rendered unable to Activate in some other way, then their Heroic Move is cancelled and the Might Point spent is lost.\n\n<b>With Me<\/b> - A Hero who is performing a Heroic Move may choose to shout \"With Me\" as soon as they are Activated. If they do, note their starting position before they Activate. All friendly models within 6\" of the Hero when they shout With Me are automatically affected, and after the Hero has finished their Activation, they must choose to do one of two things:\n\n- Activate as normal in an order chosen by their controlling player. Any model that Activates as part of a With Me must finish their Activation within 6\" of the Hero that shouted With Me. If the model attempts to finish their Activation within 6\" of the Hero, but fails a roll (such as a Courage Test, Jump Test or Climb Test) that makes this impossible, they simply stop where they are.\n- Forego their Activation, in which case they do not Activate and cannot do so later in the Move Phase. A model that cannot finish its Activation within 6\" of the Hero that shouted With Me must choose this option.\n\nIn either case, the affected models cannot be Activated again later in the Move Phase for any reason.\n\nA Hero that shouts With Me doesn't have to Move as part of their Activation, and as With Me is shouted at the start of their Activation, if anything would render them unable to Move as part of their Activation (such as failing a Courage Test to Charge an enemy with the Terror special rule) then they will still shout With Me. However, should the Hero be removed as a casualty for any reason (such as fleeing or suffering Falling Damage) then their Heroic Move and With Me will immediately be cancelled.\n\nIf two friendly Hero models within 6\" of each other both declare a Heroic Move, and the one that goes first shouts With Me, the second Hero has two options:\n\n- Activate as normal for a model affected by With Me, in which case their Heroic Move will be cancelled.\n- Forego their Activation, in which case they do not Activate later in the Move Phase and their Heroic Move will be cancelled.\n\nIf a Hero who shouted With Me Moves off the board, then any friendly models who are affected by their With Me may also Move off the board if able; however, if they cannot then they must choose to forego their Activation. If a model is affected by a Hero model's With Me, then they can only Move off the board if that Hero also does so."
  },
  {
    "name":"Heroic Resolve",
    "type":"heroic_action",
    "active_passive":null,
    "description":"(Move Phase) When a Hero declares a Heroic Resolve, it has two effects, the first of which is resolved as soon as the Heroic Action is declared. Friendly models within 6\" of a Hero who has declared a Heroic Resolve gain an additional free dice when making Resist Tests until the End Phase of the turn. Note that for models that have no Will Points (or none remaining), this allows them to make a Resist Test on one dice rather than none.\n\nAdditionally, a Hero who declares a Heroic Resolve will automatically pass any Courage Tests they are required to make that turn as a result of their Army being Broken. If a Hero who has declared a Heroic Resolve is Charged and Engaged in Combat before they are able to Activate, they are still able to Activate solely in order to provide a Stand Fast even though they would not normally be able to (though this is the only thing they can do in this Activation). However, a Hero who has been rendered unable to Activate by some other means (such as being Transfixed) still cannot provide a Stand Fast as normal."
  },
  {
    "name":"Heroic Shoot",
    "type":"heroic_action",
    "active_passive":null,
    "description":"(Shoot Phase) A Heroic Shoot allows a Hero to Shoot before all other models in the Shoot Phase. A Hero does not need to have a Missile Weapon to declare a Heroic Shoot, but they cannot declare a Heroic Shoot if they are Engaged in Combat.\n\n<b>Loose<\/b> - A Hero who is performing a Heroic Shoot may choose to shout \"Loose\". The Hero does not need to Shoot first (or at all if they don't wish to) when they shout Loose.\n\nIf they do, all friendly models within 6\" of the Hero when they shout Loose are automatically affected, and may also Shoot at the same time as the Hero - in an order chosen by their controlling player.\n\nFriendly models affected by the Loose of a friendly Hero do not need to target the same enemy model, and may Shoot as normal. However, any model affected by a friendly Hero model's Loose that chooses not to Shoot as part of it cannot then do so later that Shoot Phase."
  },
  {
    "name":"Heroic Strength",
    "type":"heroic_action",
    "active_passive":null,
    "description":"(Fight Phase) A Hero that declares a Heroic Strength will count their Strength characteristic as double (to a maximum of 10) when making Strikes until the End Phase of the turn."
  },
  {
    "name":"Heroic Strike",
    "type":"heroic_action",
    "active_passive":null,
    "description":"(Fight Phase) A Hero that declares a Heroic Strike will add D3 to their Fight Value for the duration of the Fight Phase (to a maximum of 10). This D3 is rolled at the start of the first Combat that the Hero is involved in that Fight Phase, and will last for the duration of the Fight Phase. This bonus is always applied after any other effects that would affect a model's Fight Value."
  },
  {
    "name":"Horse Lord",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"Whenever the Mount of a model with this special rule suffers a Wound, roll a D6 on a natural 6, the Wound is ignored. Additionally, a model with this special rule can use their own Fate Points to prevent Wounds inflicted upon their Mount."
  },
  {
    "name":"Instill Fear",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Temporary\n\nThis Magical Power targets the caster. Enemy models within 6\" of the caster are considered to have the Fearful special rule."
  },
  {
    "name":"Invisible",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"A model that is Invisible cannot be targeted by Magical Powers, Shooting Attacks or special rules and other models cannot draw Line of Sight to it.\n\nAn Invisible model has no Control Zone, and models (from either side) may Move through them as if they were not there, though they cannot finish their Move overlapping the Invisible model. An Invisible model may Move through other models (from either side) and may ignore enemy Control Zones; however, it may not end its Move overlapping another model.\n\nIf a model wishes to Charge an Invisible model, they must take an Intelligence Test, suffering a -1 penalty to the test for every full l\" that the Invisible model is away from them. If this Intelligence Test is failed, the model may not Charge the Invisible model at all that turn, but may Charge a different target if they wish.\n\nAn Invisible model may declare Heroic Actions, but friendly models may never benefit from their Heroic Actions. So, an Invisible model cannot shout With Me, At the Double, Loose or Take Aim, and if they declare a Heroic Combat, other friendly models cannot Move as part of it. An Invisible model also cannot provide a Stand Fast.\n\nDuring the Fight Phase, if an Invisible model is Engaged in Combat and has no other friendly models as part of the Combat, they will halve the Fight Value of all enemy models they are Engaged in Combat with. A friendly model cannot Support an Invisible model, and models cannot Support a model that is only fighting an Invisible model.\n\nNone of the above applies to Sauron or Ringwraith models see the Will of Evil special rule for further details."
  },
  {
    "name":"Large Target",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"When a model makes a Shooting Attack that targets a model with this special rule, when they are determining models that are In The Way, they ignore models (both friendly and enemy) that do not have any of the following keywords: Monster, Siege Engine, War Beast. If the target model is Engaged in Combat, then the In The Way test for Shooting into Combat is still applied regardless of the model the target model is Engaged in Combat with."
  },
  {
    "name":"Leader (X)",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"A model with this special rule can include Warrior models of the type listed in brackets in their Warband."
  },
  {
    "name":"Master of Battle (X)",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"Whenever an enemy Hero declares a Heroic Action within 6\" of this model, this model may roll a D6. If the result on the dice equals or beats the number shown in brackets, then this model may immediately declare a Heroic Action of the same type without spending a Might Point. This may still be done if this model has no Might Points remaining, or would not normally be able to declare that Heroic Action. If the roll is failed, this model may still declare a Heroic Action if they wish (though not one they cannot usually declare), for the usual cost of a Might Point."
  },
  {
    "name":"Mighty Blow",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"For each successful Strike caused by this model (i.e. one that causes a Wound that is not prevented), the target will suffer 2 Wounds rather than 1."
  },
  {
    "name":"Mighty Hero",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"A model with this special rule gains a free Might Point at the start of each turn (even if their store of Might is full). If this free Might Point has not been spent by the end of the turn, it is lost."
  },
  {
    "name":"Monstrous Charge",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"If a model with this special rule Charges into Combat, then it will increase its Attacks characteristic by 1 during the ensuing Fight Phase. Additionally, if this model Charges and subsequently wins the Duel Roll, then all enemy models involved in the Combat with a Strength characteristic lower than this model, will be immediately knocked Prone before this model makes Strikes. Cavalry models will automatically count as suffering the Knocked Flying result on the Thrown Rider Chart."
  },
  {
    "name":"Mountain Dweller",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"A model with this special rule may Move through areas of rocky terrain that are classed as Difficult Terrain as if they are Open Ground. If a Cavalry model has this special rule, but their Mount does not, then this rule does not apply to the Mount. If a Mount has this special rule, then they will still retain their Cavalry Charge bonuses when they Charge, even if the rider does not have this special rule. Additionally, a model with this special rule may re-roll any Jump, Leap, or Climb Tests."
  },
  {
    "name":"Nature's Wrath",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Instant\n\nThis Magical Power targets all enemy models within range, even if they are not in Line of Sight of the caster. All targets models are immediately knocked Prone. Cavalry models are automatically treated as suffering a Knocked Flying result on the Thrown Rider Chart."
  },
  {
    "name":"Panic Steed",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Instant\n\nThis Magical Power targets one enemy Cavalry model within range. The rider is thrown and the Mount immediately flees and is removed as a casualty. The rider is automatically treated as suffering a Knocked Flying result on the Thrown Rider Chart."
  },
  {
    "name":"Paralyse",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Exhaustion\n\nThis Magical Power targets one enemy model in range. The target immediately becomes Paralysed. A Paralysed model immediately becomes Prone and may do nothing until it recovers. This includes Activating, making Shooting Attacks, declaring Heroic Actions or using Active abilities. If a Paralysed model is Engaged in Combat, it may contribute no dice to the Duel Roll, and does not provide its Fight Value – it may also not make Strikes or stand up if it loses the duel. If a Paralysed model is the only model from its side involved in a Combat, then it automatically loses the Duel Roll – no dice are rolled.\n\nAt the end of the End Phase of each turn, a Paralysed model may roll a D6. On a 6, the model recovers (they may use Might to improve this roll). Additionally, after making this roll, any friendly model in base contact with a Paralysed model may roll a D6 one at a time. If any model rolls a 6, the Paralysed model immediately recovers (a Hero model may use their own Might to improve this roll).\n\nIf a Paralysed model is in water or feature at the end of the Move Phase, then it must take a Swim Test to see if it sinks."
  },
  {
    "name":"Poisoned Attacks (X)",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"A model with this special rule must re-roll any To Wound Rolls of a natural 1 when making Shooting Attacks or making Strikes. Sometimes, a particular weapon will be described as benefiting from this special rule. When this is the case, only To Wound Rolls made for that weapon will be able to re-roll To Wound Rolls of a natural 1."
  },
  {
    "name":"Protection of the Valar",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Temporary\n\nThis Magical Power targets one friendly model within range. The target cannot be chosen as the target of enemy Magical Powers or enemy special rules that specifically target a  model. Additionally, enemy models that target the protected model will suffer a -1 penalty to their To Hit roll."
  },
  {
    "name":"Rappelling Lines",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"Models in the Howdah may attempt to dismount during their Activation by rolling a D6. On a 2+, the model dismounts and is placed in base contact with the Mumak. However, on a 1 the model suffers Falling Damage - if it survives, place it in base contact with the Mumak. A model that        successfully dismounts may then continue its  Activation as normal, even Charging if it    wishes, though may not make a shooting    attack that turn."
  },
  {
    "name":"Renew",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Instant\n\nThis Magical Power targets one friendly model in range. The target immediately regains 1 Wound lost earlier in the battle. If this Magical Power targets a Cavalry model, the caster must choose whether the rider or the Mount is the target."
  },
  {
    "name":"Resistant to Magic",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"Every time this model is targeted by a Magical Power, they gain an additional free dice when making a Resist Test, even if they have no Will Points remaining or decide not to use any Will Points. This is cumulative with other rules that confer a similar effect."
  },
  {
    "name":"Rocks",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"If they do not Move in their Activation, models in the Howdah can make a shooting attack with range 8\" and Strength 6 instead of using a different shooting attack."
  },
  {
    "name":"Set Ablaze",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"A model can be Set Ablaze through a number of means. During the End Phase of a turn, any model that is Set Ablaze will immediately suffer one Strength 5 hit. A model that is Set Ablaze can extinguish the flames either by Lying Down and Crawling 1\", or by entering a water feature. If either of these things happen, the model is no longer considered to be Set Ablaze. If a model is immune to fire-based attacks, they cannot be Set Ablaze under any circumstances."
  },
  {
    "name":"Severed Heads",
    "type":"special_rule",
    "active_passive":null,
    "description":"If a Mordor War Catapult chooses to fire Severed Heads, determine the actual target as normal. Then, instead of rolling To Wound, the actual target and any enemy models within 3\" of them must each take a Courage test. If the test is failed, the model flees and is removed as a casualty."
  },
  {
    "name":"Sharpshooter",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"When a model with this special rule makes a Shooting Attack that targets a Cavalry model, it may choose either the rider or the Mount as its target. Additionally, if a model with this special rule hits a Cavalry model that it targeted with a Shooting Attack, it does not need to make the In The Way Test to see which part of the model it hits - it will automatically hit the part of the model it targeted, either rider or Mount."
  },
  {
    "name":"Shieldwall",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"If this model is carrying a shield, then whilst it is in base contact with two or more other friendly models who also have this special rule and are carrying a shield, then this model receives an additional +1 bonus to its Defence. In Combat, this bonus is calculated before the model Backs Away.\n\nModels that are Prone or have the Cavalry keyword cannot benefit from, or provide an ally with the benefit from, this special rule."
  },
  {
    "name":"Sigils of Defiance",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"The Mumak and any models in the Howdah gain the     Resistant to Magic, and whenever they suffer a Wound they may roll a D6. On a natural 6, the Wound is prevented."
  },
  {
    "name":"Sorcerous Blast",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Instant\n\nThis Magical Power targets one enemy model in range. The target immediately suffers one Strength 5 hit. If they survive, they are immediately knocked Prone. If the target was a Cavalry model, they will automatically count as suffering the Knocked Flying result on the Thrown Rider Chart.\n\nIf the target was Engaged in Combat, then any other model that's also Engaged in the same Combat will also be knocked Prone if it has a Strength of 5 or lower - make sure to Pair Off Combats before working out which models are knocked Prone in this manner."
  },
  {
    "name":"Spectral Walk",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"A model with this special rule is never slowed by Difficult Terrain. Additionally, a model with this special rule always counts as rolling a 6 for any Climb, Jump, Leap or Swim Tests."
  },
  {
    "name":"Stalk Unseen",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"An Infantry model with this special rule that is partially concealed from view by a piece of terrain cannot be seen at distances of more than 6\". This means that enemy Models cannot target this model with Shooting Attacks, Magical Powers, special rules, or anything else that requires Line of Sight unless they have a completely clear view of this model."
  },
  {
    "name":"Static",
    "type":"special_rule",
    "active_passive":null,
    "description":"If a Siege Engine has the Static special rule, then it can be Moved or rotated."
  },
  {
    "name":"Strengthen Will",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Instant\n\nThis Magical Power targets one friendly model within range. The target immediately regains a single Will Point spent earlier in the battle. If this Magical Power targets a Cavalry model, the caster must choose whether the rider or the Mount is the target."
  },
  {
    "name":"Survival Instinct",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"Every time a model with this special rule suffers a Wound that is not prevented, it must take a Courage Test. If the Courage Test is failed, the model flees and is removed from the board as a casualty. This is an exception to taking multiple Courage Tests of the same type in the same turn."
  },
  {
    "name":"Swift Movement",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"A model with this special rule is never slowed by Difficult Terrain, with the exception of water features. It can also ignore Obstacles as it Moves, allowing it to Move at any angle without having to make a Climb or Jump Test, though it will still count any vertical distance it has Moved towards its Move Value. A model with this special rule must finish its Move as flat to the playing surface as possible - no models finishing upside down, halfway up a wall, or at an angle, for example!"
  },
  {
    "name":"Sworn Protector (X)",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"Models with this special rule will have a specific model listed in brackets as part of the special rule. Whilst the named model is alive and on the battlefield, this model automatically passes all Courage Tests it is required to make."
  },
  {
    "name":"Terrifying Aura",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Exhaustion\n\nThis Magical Power targets the caster. Whilst this Magical Power is in effect, the caster has the Terror special rule."
  },
  {
    "name":"Terror",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"If a model wishes to Charge a model with this special rule, then it must take a Courage Test at the start of its Move. If the test is passed, the model may Charge as normal. If the test is failed, the model cannot Move that turn, but may otherwise act normally.\n\nSometimes a situation may open up the chance for a model to Charge a model with Terror part way through their Move, such as moving a different model with magic or killing something in the way with a throwing weapon. In such instances, the model only needs to take the Courage Test at the point in which the Terror causing model becomes possible to Charge. If a model making a Jump, Climb or Leap Test finishes within the Control Zone of an enemy with Terror and would normally be able to Charge, they will take their Courage Test after they have made their Jump, Climb or Leap Test.\n\nSometimes, a model may only cause Terror in certain enemies. In these instances, a keyword will follow Terror in brackets, and only models with that keyword will need to take a Courage Test to Charge the model. So, a model with Terror (Orc) will only cause Terror in Orc models."
  },
  {
    "name":"Throw Stones (X)",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"If this model does not Move during the Move Phase, it may make a Shooting Attack during the following Shoot Phase. The Strength and range of this Shooting Attack will be shown in the model's profile."
  },
  {
    "name":"Timid",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"If a Mount has this special rule, then every time it wishes to Charge an enemy model it must take a Courage Test. It may use its rider's Courage Value, but may never benefit from special rules or Magical Powers that would allow it to automatically pass a Courage Test. If the test is failed, the model cannot Move that turn but may otherwise act normally. A model with this special rule gains no Cavalry Charge bonuses."
  },
  {
    "name":"Transfix",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Temporary\n\nThis Magical Power targets one enemy model in range. Until the End Phase of the turn, the target cannot Activate, declare Heroic Actions, use Active Abilities, or make Shooting Attacks. If the target wins a Duel Roll, they may not make Strikes. If the target has a piece of wargear that has an Active ability, they still have that piece of wargear but cannot use the ability tied to it."
  },
  {
    "name":"Tremor",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Instant\n\nDraw an imaginary 1mm line that extends D3+3\" directly away from the caster in a direction chosen by the caster. This Magical Power targets every model (friend or foe) that lies under the line. Each target immediately suffers one Strength 4 hit and is knocked Prone; if the target was a Cavalry model, they will automatically count as suffering the Knocked Flying result on the Thrown Rider Chart. If a target is Engaged in Combat, then any other model Engaged in the same Combat is also considered to be a target - make sure to Pair Off Combats before working out which models are targets. \n\nModels with the Fly special rule can never be a target of this Magical Power under any circumstances."
  },
  {
    "name":"Tusk Weapons",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"When the Mumak Tramples, it will Inflict 4 Strength 9 Impact Hits rather than 3."
  },
  {
    "name":"Unyielding Combat Stance",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"If this model would be knocked Prone for any reason, roll a D6. On a 4+, the model keeps their footing and is not knocked Prone. If this model is mounted and passes this roll, they will still be separated from their Mount but will count as rolling a 6 on the Thrown Rider Chart. If this model would normally automatically suffer the Knocked Flying result, they may still make this roll and, if successful, will treat the result as a 6 on the Thrown Rider Chart."
  },
  {
    "name":"Venom",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"This model must re-roll all failed To Wound Rolls when making Strikes. Additionally, at the end of a Combat involving this model, choose one enemy model that was wounded by this model but not slain and roll a D6. On a natural 6, the model suffers an additional Wound."
  },
  {
    "name":"Will of Evil",
    "type":"special_rule",
    "active_passive":"Passive",
    "description":"Certain spectral creatures are only kept in existence through the sheer will of the Dark Lord. Should they become disconnected from Sauron's power, they will fade away and vanish like smoke on the breeze. This model must give up 1 Will Point during the End Phase if it has been involved in one or more Combats that turn; if it is in base contact with an enemy model, it is involved in that Combat - it cannot choose not to fight! Should this model be reduced to 0 Will Points, it is immediately banished and removed as a casualty. A model with this special rule cannot use their last Will Point to Cast a Magical Power or use a special rule if by doing so they would be reduced to 0 Will Points.\n\nAdditionally, this model ignores the Invisible special rule and, if it was involved in a Combat with an Invisible model that turn, does not give up a Will Point during the End Phase."
  },
  {
    "name":"Wither",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Instant\n\nThis Magical Power targets one enemy model in range. The target immediately reduces their Strength value by 1 for the remainder of the game. A model can be affected by this Magical Power multiple times over the course of the battle, reducing its Strength value each time. Should a model ever have its Strength reduced to 0, they are immediately slain and removed as a casualty. If this Magical Power targets a Cavalry model, the caster must choose whether the rider or the Mount is the target."
  },
  {
    "name":"Woodland Creature",
    "type":"special_rule",
    "active_passive":"Active",
    "description":"A model with this special rule may Move through woods and forests that are classed as Difficult Terrain as if they are Open Ground. If a Cavalry model has this special rule, but their Mount does not, then this rule does not apply to the Mount. If a Mount has this special rule, then they will still gain their Cavalry Charge bonuses when they Charge, even if the rider does not have this special rule."
  },
  {
    "name":"Wrath of Bruinen",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Instant\n\nThis Magical Power targets all enemy models within range, even if they are not in Line of Sight of the caster. All target models immediately suffer one Strength 2 hit and are knocked Prone. Cavalry models are automatically treated as suffering a Knocked Flying result on the Thrown Rider Chart. If a target is within a water feature, they will suffer one Strength 8 hit instead of one Strength 2 hit."
  },
  {
    "name":"Writhing Vines",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Temporary\n\nThis Magical Power targets the caster. Place a 25mm Vine Marker wholly within 3\" of the caster. Enemy models entering the area within 3\" of the Vine Marker are treated as Difficult Terrain. Remove the Vine Marker during the End Phase."
  },
  {
    "name":"Your Staff is Broken",
    "type":"magical_power",
    "active_passive":null,
    "description":"<b>Duration<\/b>: Instant\n\nThis Magical Power targets one enemy model that has a Staff of Power within range. The target's Staff of Power is immediately destroyed - remove it from their wargear."
  }
]